{"/2010/giving-up-on-a-and-a/": [{"comment": "<p>Thanks for the posting.  You make some good points.  There is a lot of material on A&amp;A which isn't particularly professional.  Sometimes people behave in a less than dignified manner.  </p><p></p><p></p><p>Personally, I agree that blogs can have a substantial amount of useful information.  Can, but don't always.  So, the decision to read and or participate in a blog is much like reading and participating on a list like A&amp;A.  Some are worth the effort, some are not.  Choose what works, and stick with it, drop the rest. </p><p></p><p></p><p>I'm less enthused by Twitter - I don't use it.  Got something to say?  Please send me an e-mail.  No, I don't want cute abbreviations, I want something easy to read in standard English.  </p><p></p><p></p><p>Social networking?  No, thank you.  Not my cup of tea.  </p><p></p><p></p><p>And, a last comment regarding the Virtual Picnic.  It isn't my favorite thing.  but I cheerfully delete all that stuff unread.  Meanwhile, I note you have links to a bunch of enjoyed things on your page.  Is that really much different than the virtual picnic?  I don't see much difference.  And, like the picnic, I probably won't open any of the 'enjoyed things' graphics.  They don't offend me.  They just don't appeal to me, either.  </p><p></p><p></p><p>Thanks.  </p><p></p><p></p><p>CVM<br>-30-</p>", "indent": 0, "name": "Charles V. Mutschler", "date": "2010-07-29T21:29:29Z", "path": "/2010/giving-up-on-a-and-a/", "order": "002512145162"}, {"comment": "<p>word.</p>", "indent": 0, "name": "holly", "date": "2010-08-24T19:46:29Z", "path": "/2010/giving-up-on-a-and-a/", "order": "002512145161"}, {"comment": "<p>I certainly agree with #4.</p><p></p><p></p><p>I lurk on the EAD list and have noticed how helpful all the replies on that venue are. If I ever have a need to post there I'm confident I'll get a good reply. </p><p></p><p></p><p>It is quite off putting to see professionals bad mouth newer forms of communication. Just because you don't find value in blogs or Twitter doesn't mean that others don't or won't if they tried it. </p><p></p><p></p><p>Aren't archivists  supposed to support the preservation of wide ranging historical records and not show bias against what one scholar finds useful or not useful? Are the \"records\" generated in these other venues any less valid that the \"records\" generated by the list? </p><p></p><p></p><p>I suppose I'm simply not comfortable with people making assumptions about what is the \"proper\" form of communication and exchange of ideas in our field.</p>", "indent": 0, "name": "LurkerArchivist", "date": "2010-07-29T05:05:51Z", "path": "/2010/giving-up-on-a-and-a/", "order": "002512145160"}, {"comment": "<p>Yeah it's funny--I actully unsubscribed myself last week for similar reasons.</p>", "indent": 0, "name": "Andy", "date": "2010-08-02T17:14:24Z", "path": "/2010/giving-up-on-a-and-a/", "order": "002512145155"}, {"comment": "<p>There are a couple of people in particular that treat the A&amp;A listserv as if it is their personal blog.  Then they go off on ax-grinding escapades that have nothing to do with professional issues, just their own.  I scan the messages every now and then, but I stopped subscribing about 2 years ago.</p>", "indent": 0, "name": "Jordan", "date": "2010-09-13T23:43:13Z", "path": "/2010/giving-up-on-a-and-a/", "order": "002512145153"}, {"comment": "<p>The flowers and picnic silliness don't bother me that much--as a matter of fact, if we could replace 10% of the posts with pretty pictures of random objects, I think it would be an improvement. What bothers me is the day-to-day rudeness of people who confuse the \"right to post\" with being willfully disrespectful to the majority of subscribers. </p><p></p><p></p><p>I don't have any good suggestions for reforming the list, because the people who actually post to the list seem to like things the way they are. My only suggestion is for SAA to stop sponsoring it altogether, and maybe at most to replace it with something designed entirely for announcements, no \"discussions\" allowed.</p>", "indent": 0, "name": "Christopher", "date": "2010-07-29T20:36:17Z", "path": "/2010/giving-up-on-a-and-a/", "order": "002512145151"}, {"comment": "<p>Re: item 4, I wholeheartedly agree.  I subscribe to the EAD list and the AT Users' Group, both of which are full of knowledgeable and helpful people.  When doing an audio project, I relied heavily on the knowledge available through the ARSC listserv as well as an uber geeky audiophile list.  So what other lists do you, Mark or others, subscribe to/recommend?</p>", "indent": 0, "name": "Christie Peterson", "date": "2010-07-29T16:50:33Z", "path": "/2010/giving-up-on-a-and-a/", "order": "002512145159"}], "/2006/is-open-data-the-point/": [{"comment": "<p>I actually don't dispute what you're saying here.  And, yes, there <em>is</em> a disconnect between the techies and the catalogers, but I'm not sure how opening up the data interferes with catalogers' workflows (neither you nor Dan have really made that clear).</p><p>The problem with your last statement (and this was my point and, really, the only reason I was on the podcast at all, as far as I can tell) is, are you sure you can give anybody a dump of your catalog?  Are you sure that you actually own your data?</p><p>I don't really care much about the LC data.  I don't really care much about your data.  But somebody might be.  I am, however, interested in data from my own catalog, Emory's catalog (we have a joint degree program) and the public libraries that serve our communities.  But why should I have to explain to the myriad public libraries what my intentions are?</p>", "indent": 0, "name": "Ross", "date": "2006-12-29T22:58:48Z", "path": "/2006/is-open-data-the-point/", "order": "002512144976"}, {"comment": "<p>It seems as if the NUCMC records will no longer be available in the distributions, as well:</p><p><a href=\"http://www.loc.gov/cds/notices/20061117-a.pdf\" rel=\"nofollow noopener\" title=\"http://www.loc.gov/cds/notices/20061117-a.pdf\">http://www.loc.gov/cds/noti...</a><br><a href=\"http://www.loc.gov/cds/tfmds.html\" rel=\"nofollow noopener\" title=\"http://www.loc.gov/cds/tfmds.html\">http://www.loc.gov/cds/tfmd...</a></p><p>That's a really rich source of records for archivists to lose, especially for a place like AIP and its ICOS.  It's a shame, because not all small archives can afford any of the OCLC/RLG services that will pick up the slack</p><p>Clay</p>", "indent": 0, "name": "Clay", "date": "2007-01-05T07:44:17Z", "path": "/2006/is-open-data-the-point/", "order": "002512144980"}], "/2009/yet-another-job-change/": [{"comment": "<p>Congratulations!   Looking forward to hearing about what you're up to as you explore strange new fonds .  Seek new life in New Haven.  And boldly go where no archivist has gone before. (cue music)</p>", "indent": 0, "name": "Richard", "date": "2009-12-22T20:55:35Z", "path": "/2009/yet-another-job-change/", "order": "002512145121"}, {"comment": "<p>Hi Daniel! My first day is January 25 - so pretty soon no less!</p>", "indent": 0, "name": "Mark A. Matienzo", "date": "2010-01-09T21:44:37Z", "path": "/2009/yet-another-job-change/", "order": "002512145127"}, {"comment": "<p>Congrats!</p>", "indent": 0, "name": "Jenny", "date": "2010-01-28T21:49:41Z", "path": "/2009/yet-another-job-change/", "order": "002512145125"}, {"comment": "<p>Clam pie? Is that what you're calling it these days?  good luck and congrats!</p>", "indent": 0, "name": "Julie", "date": "2009-12-23T01:37:27Z", "path": "/2009/yet-another-job-change/", "order": "002512145134"}, {"comment": "<p>Congratulations!</p>", "indent": 0, "name": "Seth", "date": "2009-12-22T17:38:18Z", "path": "/2009/yet-another-job-change/", "order": "002512145135"}, {"comment": "<p>Man, you are going to be DESPERATELY missed around here. It's been an absolute pleasure to work with you (and your enthusiasm for what you do). Enjoy the heck out of Yale!</p>", "indent": 0, "name": "Michael Lascarides", "date": "2009-12-22T19:54:04Z", "path": "/2009/yet-another-job-change/", "order": "002512145130"}, {"comment": "<p>Congratulations! I saw that opening but have kind of learned to love the west coast. Rock it, and keep us informed of new initiatives. I like to remind stakeholders that we are [b] already behind [/b]</p>", "indent": 0, "name": "Alex Hauschild", "date": "2010-03-10T02:38:53Z", "path": "/2009/yet-another-job-change/", "order": "002512145131"}, {"comment": "<p>Well played, Matienzo! Best wishes as a Nutmegger/Ivy/Yalie.</p>", "indent": 0, "name": "Stephen Francoeur", "date": "2009-12-23T00:54:23Z", "path": "/2009/yet-another-job-change/", "order": "002512145132"}, {"comment": "<p>Hi Mark. This is great news! I'll be happy to treat you to beer and pizza at Modern. When do you start?</p><p></p><p>&lt;ul&gt;<br>&lt;li&gt;Daniel (at Yale)&lt;/li&gt;<br>&lt;/ul&gt;</p>", "indent": 0, "name": "Daniel", "date": "2009-12-24T23:35:23Z", "path": "/2009/yet-another-job-change/", "order": "002512145133"}], "/2009/adrupal-built-archives-reference-blog/": [{"comment": "<p>Very cool! And perhaps that Rickover report warrants an item-level record in your OPAC--would make it really easy for your local campus audience to find it too, not to mention having WorldCat tell the world that your college owns it.</p>", "indent": 0, "name": "Jackie Dooley", "date": "2009-05-06T01:46:28Z", "path": "/2009/adrupal-built-archives-reference-blog/", "order": "002512145068"}], "/2008/code4libcon2008/": [{"comment": "<p>I can't stop laughing. Thanks.</p>", "indent": 0, "name": "Emily Lynema", "date": "2008-03-19T20:25:51Z", "path": "/2008/code4libcon2008/", "order": "002512144990"}], "/2008/saa2009-proposal-deadlines-open-letter/": [{"comment": "<p>Mark,</p><p></p><p></p><p>Your comments are well taken and many people appreciate bringing into light such a topic. I am hoping that in future meetings these deadlines take into consideration the needs of others.</p>", "indent": 0, "name": "Matienzo L.J., Ph.D.", "date": "2008-10-06T04:32:15Z", "path": "/2008/saa2009-proposal-deadlines-open-letter/", "order": "002512145009"}, {"comment": "<p>Good for you, Mark!</p>", "indent": 0, "name": "Russell D. James, CA", "date": "2008-10-02T22:55:19Z", "path": "/2008/saa2009-proposal-deadlines-open-letter/", "order": "002512145013"}], "/2008/does-saa-need-to-support-who-i-am/": [{"comment": "<p>I agree with you that SAA should not get involved in this, and posted a comment over at Archives Found on the subject. </p><p></p><p></p><p>However, it's also worth noting that participation in these kinds of groups would be voluntary. One would make the choice whether or not to self-identify, so I'm not sure how great an invasion of privacy it would be. </p><p></p><p></p><p>That said, people can organize whatever they want to outside of SAA and if others want to get involved, that's great. It's a free country!</p>", "indent": 0, "name": "Kate T.", "date": "2008-12-17T21:29:49Z", "path": "/2008/does-saa-need-to-support-who-i-am/", "order": "002512145034"}], "/2018/beyond-hearing-one-another/": [{"comment": "<p>If it's accepted at DLF Forum 2018, Hillel, Sandy Rodriguez, Rafia Mirza, and I will be doing a panel/q&amp;a about our attempts at, <br>failures to, and overall learning process in trying to value labor when either managing (Hillel &amp; Sandy) or being the person between the administration and a team while not having any actual power (Rafia &amp; me). We've formatted it primarily as open and I hope it'll be a place for conversation. It's certainly not a place where we have all the answers.</p>", "indent": 0, "name": "Ruth Kitchin Tillman", "date": "2018-06-11T16:16:24Z", "path": "/2018/beyond-hearing-one-another/", "order": "003939719060"}, {"comment": "<p>Thanks for this, Mark. Hope you got to see Ben. He's one of my go-tos for understanding myself better too.</p>", "indent": 0, "name": "Alex Gil", "date": "2018-06-11T16:58:23Z", "path": "/2018/beyond-hearing-one-another/", "order": "003939782021"}], "/2009/leaked-sirsidynix-report/": [{"comment": "<p>I find it a curious strategy to blast OSS initiatives for failures that SirsiDynix products are just as (if not more) prone to.</p><p></p><p></p><p>(My comments may not reflect the opinions of my employer(s).)</p>", "indent": 0, "name": "Scot Colford", "date": "2009-10-31T02:14:03Z", "path": "/2009/leaked-sirsidynix-report/", "order": "002512145122"}, {"comment": "<p>I'd also like to know why they thought that the United States Department of Defense restricts the use of open source source software. They have supported the purchase and internal development of OSS since 2003, and this year released a memo to employees making it clear that laws and policies do not discourage the consideration of OSS. They are concerned that the department isn't making the most of OSS options when considering commercial bids and for internal development.</p><p></p><p></p><p><a href=\"http://www.dwheeler.com/blog/2009/10/27/#dod-oss-2009\" rel=\"nofollow noopener\" title=\"http://www.dwheeler.com/blog/2009/10/27/#dod-oss-2009\">http://www.dwheeler.com/blo...</a></p>", "indent": 0, "name": "wlayton", "date": "2009-10-30T17:49:36Z", "path": "/2009/leaked-sirsidynix-report/", "order": "002512145118"}, {"comment": "<p>Maybe it was something misoverheard at a conference, like the famous Peter Mandelson \"chumps\" comment.</p><p></p><p></p><p>On the \"at a cheaper cost than the redevelopment effort\" - systems like SirsiDynix appear to be infinite costs for our library services, where libraries must keep paying forever and ever and ever, while at least with Free and Open Source Software (FOSS), there's some hope of sustainability one day.</p>", "indent": 0, "name": "MJ Ray", "date": "2009-10-30T12:38:14Z", "path": "/2009/leaked-sirsidynix-report/", "order": "002512145120"}, {"comment": "<p>Hardware costs were a  large contributing factor in the Nelsonville Public Library's decision to move to Koha after being told by our previous vendor that we'd need to pay an exorbitant amount on new Windows servers for our upgrade.</p><p></p><p></p><p>The Clifford Lynch quote isn't the only example of assertions in this document requiring citation. I think <em>most</em> of the assertions need to be justified with references.</p>", "indent": 0, "name": "Owen Leonard", "date": "2009-10-30T19:28:17Z", "path": "/2009/leaked-sirsidynix-report/", "order": "002512145119"}, {"comment": "<p>MJ, The Georgia PINES state consortium built the Evergreen open source library system from scratch for less than the cost of one year's support and licensing for their pre-existing Sirsi catalogue.</p><p></p><p></p><p>As far as hardware in concerned, Sirsi required PINES to use Sun Solaris servers, which are premium-priced devices. With Evergreen, PINES was able to replace the Sun hardware with stock Dell rack-mounted server hardware.</p>", "indent": 0, "name": "David Fiander", "date": "2009-10-30T18:28:03Z", "path": "/2009/leaked-sirsidynix-report/", "order": "002512145115"}], "/2008/developing-automated-repository-deposit-modules-for-archivists-toolkit/": [{"comment": "<p>Well, this repository manager would be thrilled to see that! And yes, I do believe SWORD is the way to go.</p>", "indent": 0, "name": "Dorothea Salo", "date": "2008-11-18T17:51:13Z", "path": "/2008/developing-automated-repository-deposit-modules-for-archivists-toolkit/", "order": "002512145016"}], "/2010/aus-archivists-listserv/": [{"comment": "<p>So, a bunch of archivists experts lost their archive as well as their real-time nemesis? Ouch. And, uh, WTF?</p>", "indent": 0, "name": "Alex", "date": "2010-11-18T14:41:10Z", "path": "/2010/aus-archivists-listserv/", "order": "002512145172"}, {"comment": "<p>I agree with your sentiments, and I think preservationists have the most difficult job in Library Land -- <a href=\"http://bit.ly/9gX1vc\" rel=\"nofollow noopener\" title=\"http://bit.ly/9gX1vc\">http://bit.ly/9gX1vc</a></p><p>Furthermore, it will be increasingly difficult to do this work as more content \"moves to the 'cloud'\". If you don't physically have it, then you can't curate it. And if it is in a format other than plain text, then you dramatically increase the risk of not being able to read it in the future.</p>", "indent": 0, "name": "Eric Lease Morgan", "date": "2010-11-18T15:50:39Z", "path": "/2010/aus-archivists-listserv/", "order": "002512145168"}], "/2011/how-to-hack-saa/": [{"comment": "<p>Thanks for this! I'm a bit nervous as a first timer, but am looking forward to jumping in [especially at the tweet-up]! Also nice for the reminder that sessions aren't the be-all end-all.</p>", "indent": 0, "name": "Liz", "date": "2011-08-22T02:58:00Z", "path": "/2011/how-to-hack-saa/", "order": "002512145207"}, {"comment": "<p>This will also be my first time at SAA. Thanks for the advice!</p>", "indent": 0, "name": "Amber", "date": "2011-08-24T21:53:06Z", "path": "/2011/how-to-hack-saa/", "order": "002512145204"}], "/2010/nara-and-data-dot-gov/": [{"comment": "<p>Hi Mark,</p><p></p><p></p><p>I work at NARA on social media and ARC.  We heard about your blog post from Kate Theimer on our NARAtions blog.</p><p></p><p></p><p>We are really excited to hear that you and others are eager to start crunching the data NARA has made available!  It wasn't that we didn't bother to compress the data.  NARA IT staff kept running into technical issues while working on the compression, so we decided to go ahead and post it uncompressed rather than hold it back.  I'm impressed that you, Simon and Richard figured out a solution to compress and share it. </p><p></p><p></p><p>I hope you'll keep us posted on anything cool that comes out of your work with the data.  Have fun!</p>", "indent": 0, "name": "Jill", "date": "2010-01-30T02:57:33Z", "path": "/2010/nara-and-data-dot-gov/", "order": "002512145147"}, {"comment": "<p>Hi Jill, thanks for the additional comments! I appreciate everything that you and your colleagues at NARA did to get the data out there.</p>", "indent": 0, "name": "Mark A. Matienzo", "date": "2010-01-30T03:48:17Z", "path": "/2010/nara-and-data-dot-gov/", "order": "002512145140"}, {"comment": "<p>Thanks for the mention, but the credit really goes to you and Simon!  </p><p></p><p></p><p>I'll be interested to see what comes of this public data!</p>", "indent": 0, "name": "Richard", "date": "2010-01-30T05:24:07Z", "path": "/2010/nara-and-data-dot-gov/", "order": "002512145143"}], "/2010/code4lib-2010/": [{"comment": "<p>Totally agree, Mark. I think this conference was the best yet. Dare I hope that it has merely raised a bar that we will continue raising?</p>", "indent": 0, "name": "Roy Tennant", "date": "2010-03-02T10:16:47Z", "path": "/2010/code4lib-2010/", "order": "002512145149"}], "/2006/morristown-calling-marac-fall-meeting/": [{"comment": "<p>OK, I'll leave you a note on the message board when I find it in the morning.</p>", "indent": 0, "name": "Rob Jenson", "date": "2006-10-27T07:42:14Z", "path": "/2006/morristown-calling-marac-fall-meeting/", "order": "002512144972"}, {"comment": "<p>hey! im from morristown. i took art classes at the morris museum... uh..  a really really long time ago.<br>i hope they treated you well there.</p>", "indent": 0, "name": "sean", "date": "2006-11-03T20:01:43Z", "path": "/2006/morristown-calling-marac-fall-meeting/", "order": "002512144975"}], "/2009/developing-metrics-for-experimental-forms-of-outreach/": [{"comment": "<p>Hey Mark, </p><p></p><p></p><p>Thanks for the follow-up. Why don't you post this over at AN too? </p><p></p><p></p><p>I am having no luck generating any discussion of metrics in any form, other than, as I said, people wanting to know what I find out. Again, people must be doing some kind of measuring and reporting. Apparently I will have to send direct messages to 2.0 users in order to draw this out rather than relying on the lazy way out. </p><p></p><p></p><p>Kate</p>", "indent": 0, "name": "Kate T.", "date": "2009-02-17T18:14:04Z", "path": "/2009/developing-metrics-for-experimental-forms-of-outreach/", "order": "002512145046"}], "/2008/going-off-the-rails-really-rapid-prototyping-with-drupal/": [{"comment": "<p>PAC makes me think somehow about hierarchial state machines,<br>see for example:</p><p><a href=\"http://link.brightcove.com/services/player/bcpid1733261879?bclid=1729365228&amp;bctid=1743215121\" rel=\"nofollow noopener\" title=\"http://link.brightcove.com/services/player/bcpid1733261879?bclid=1729365228&amp;bctid=1743215121\">http://link.brightcove.com/...</a></p>", "indent": 0, "name": "Lee", "date": "2008-12-31T22:30:09Z", "path": "/2008/going-off-the-rails-really-rapid-prototyping-with-drupal/", "order": "002512145070"}], "/2011/burnout/": [{"comment": "<p>I'm so burned out that I've been skipping reading the blogs, etc., so I missed this until today.</p><p>You and me both, my friend. If we're not actually in the same boat, we're drifting right beside each other.</p><p>I've got all this stuff on my desk/plate that I just want to throw out the window because I'm bored to tears with it now or don't feel there's any real value in spending time on it. Every day I have ideas about other things I'd rather be doing, but I can't because I'm locked into these commitments. The hardest part for me is slogging through the tedium so that I can get to the exciting shiny new things. What I promised myself I would do, to get out of this depression rut, is to allow myself to work on one new thing a few hours a week. I haven't managed to do that yet, but it sounds like a good idea.</p><p>I also think people who work at at high level of . . . quality? energy? engagement? cleverness? call it what you will, people who work at a high level get burned out at a higher level than others. I've seen it. By that I mean, being burned out hits you harder because you're used to be so excited and enthusiastic. I think you've got a good plan already. Try to relax and regroup. This is a great time of year to do it.</p><p>And although I'm too cowardly to let the world know who I am, you do, so let me know if you need someone to lend you a sympathetic ear.</p>", "indent": 0, "name": "Frustrated Archivist", "date": "2011-06-14T23:14:59Z", "path": "/2011/burnout/", "order": "002512145196"}, {"comment": "<p>There right now, doing that, don't want the T-shirt. Hoping things will change for me quite soon.</p><p>Good luck. It's a cast-iron son of a b, this.</p><p>I would only add, don't hang out with people who sap your energy, when you can avoid it.</p>", "indent": 0, "name": "Dorothea", "date": "2011-06-07T15:53:13Z", "path": "/2011/burnout/", "order": "002512145197"}, {"comment": "<p>oh, man. i've been having the worst burnout for the past few months, so much that i have been constantly thinking about and looking for other jobs. it's gotten so bad, i've even thought about just quitting and becoming a barista. but i, too, have a great job and work with great people and should be totally grateful and excited about this. anyway, it's good to know i am not alone and it's good to hear from others how to cope with this feeling. maybe i can stay sane a little longer.</p>", "indent": 0, "name": "Aly", "date": "2011-06-08T21:26:34Z", "path": "/2011/burnout/", "order": "002512145195"}, {"comment": "<p>Looks like you have a good list there.</p><p>I might add that you should give yourself a break from feeling that anything less than 100% enthusiasm is worthless. You can't stay full tilt endlessly, which clearly you know. But saying to yourself that it is okay to cycle down to less investment for a time might reduce the guilt portion of what you are going through.</p><p>Hang in there and good luck.</p>", "indent": 0, "name": "Jeanne", "date": "2011-06-07T17:36:40Z", "path": "/2011/burnout/", "order": "002512145189"}, {"comment": "<p>And a song for you, too! =) <a href=\"http://bit.ly/nKLA\" rel=\"nofollow noopener\" title=\"http://bit.ly/nKLA\">http://bit.ly/nKLA</a>  Best of luck.</p>", "indent": 0, "name": "The American Writer", "date": "2011-06-08T14:16:40Z", "path": "/2011/burnout/", "order": "002512145200"}, {"comment": "<p>I found your profile by chance on Blip and a few clicks later I'm here on your blog wishing there was something I could say to help you relax. Some doors will never open if we're pounding on them and instead of feeling frustrated by this, take it as an opportunity to slow down. From the sound of it, I bet you have a hard time slowing down, don't you? But a happy life is a balanced life. Instead of trying to hang on (which is draining what little is left of your energy) -- try letting go. Let go of the way you think things should be right now and open up to accept what is...whatever it is. I'm amused that even in your exhausted state of mind you are making lists of things that might help. It makes me smile because I was once the same way and I've had to force myself to stop trying to control everything. You just can't do it. And that barrier you're speaking of is something you can't control right now. You can waste time trying to get over it, under it, around it -- and have a miserable summer full of frustration. Or you can LET GO for a few months and come back to that barrier later. I realize I'm just a random someone you'll never know, but my words are sincere. I disagree about surrounding yourself with smart people alone as well as engaging in conversations that don't excite you. We are more than our I.Q. -- we are emotions, we are dreamers, we are all striving for the same basic things regardless of our test scores. And besides, people are smart in different ways. You know that. LET GO. Talk to interesting people. Talk to strangers. Talk about things that do excite you. Stop making rules. Break the rules. Find balance. I challenge you on your next day off to open your front door and step outside without any plans, agendas, rules or maps. LET GO and see what happens. Let us know how it goes and where your day leads you. =)</p>", "indent": 0, "name": "The American Writer", "date": "2011-06-08T13:52:09Z", "path": "/2011/burnout/", "order": "002512145201"}], "/2013/the-greatest-adventure/": [{"comment": "<p>Congrats Mark! Your experience in archives, technology and shaping/energizing minds is going to be a real asset to the DPLA.</p>", "indent": 0, "name": "Ed Summers", "date": "2013-11-20T18:13:37Z", "path": "/2013/the-greatest-adventure/", "order": "001131455726"}, {"comment": "<p>This is great news!!! Congrats!</p>", "indent": 0, "name": "nruest", "date": "2013-11-21T00:40:32Z", "path": "/2013/the-greatest-adventure/", "order": "001132000905"}, {"comment": "<p>Wow! So great to have you in a position of almost unimaginable power!</p>", "indent": 0, "name": "Bill Dueber", "date": "2013-11-21T03:56:01Z", "path": "/2013/the-greatest-adventure/", "order": "001132189774"}, {"comment": "<p>What a great mashup. This could be v. bg fun.</p>", "indent": 0, "name": "Ari Davidow", "date": "2013-11-20T19:14:22Z", "path": "/2013/the-greatest-adventure/", "order": "001131572601"}], "/2009/access-and-description-reconsidered/": [{"comment": "<p>While finishing up a two-year IMLS grant I accidentally became acting curator at the Architecture and Design Collection at UCSB.  prior to that, my work for the IMLS was as digital project archivist for two separate collections.  I  was struck by problems similar  to the ones you mention here, created by the finding aids. </p><p></p><p></p><p>The finding aids seem to create a barrier between the archivist and free access.  You used the phrase mediate access. It would seem to me that the point of a finding aid should be to minimize the need for the expert operator.  Unfortunately the opposite seems to occur.</p><p></p><p></p><p>In the case of the architecture and design collection, the finding aids don't take into account the nature of the archives as museum holdings. Rather, they attempt to describe the collections according to architectural traditions which works well, mostly.  In a museum setting, where categories, narratives, historical and visual impact are often more important to the curators, these finding aids can actually obscure those qualities.  To complicate matters, additional architectural cataloguing will further distance.  The material from \"regular\" users. </p><p></p><p></p><p>A couple years ago we were suggesting this problem could be cured by \"natural language\" description.  Whatever happened to that term?</p><p></p><p></p><p>Alexander J. Hauschild<br>Digital Project Archivist, Museum Scientist Sr.</p>", "indent": 0, "name": "Alex Hauschild", "date": "2010-03-09T03:08:54Z", "path": "/2009/access-and-description-reconsidered/", "order": "002512145101"}, {"comment": "<p>Wild-arsed guesses. Ah yes, I remember them well! (When I was a real archivist and not just peddling and meddling with archival description). </p><p></p><p></p><p>Description is, surely, required in order to enable access. But maybe archivists need to be more aware of the active role that description plays in shaping and influencing access. I've recnetly heard that the ICA are probably not going to be reviewing ISAD(G) in any depth. Shame I think.</p>", "indent": 0, "name": "Jane Stevenson", "date": "2009-10-29T20:02:30Z", "path": "/2009/access-and-description-reconsidered/", "order": "002512145098"}, {"comment": "<p></p><p></p><p></p><p>Mark, can you please clarify your use of term description in your statement:  <i>\"Archivists in part provide descriptive, contextual, and structural metadata about collections...\"</i></p><p></p><p></p><p>I am confused as to whether you are referring to archival description performed by archivists working hands-on with a collection in a processing situation.  </p><p></p><p></p><p>Or, if you are referring to the computer systems which digest these descriptions, alphabetize them, and make available searches by keyword and subject.</p><p></p><p></p><p>If the former, perhaps you could point to an archival collection you have processed or described.  Archival description relies on context,  therefore an example of an actual collection could prove useful to direct the dialogue to a practical level, out from which we could again return to the general.</p><p></p><p></p><p>If the latter, could you please describe why the technologist should concern themselves with archives in particular which are, in all senses, described in much further detail by humanists through books, chapters, dissertations and articles.  Systems of categorization, finding aids and website sites, present bare essentials and necessarily lack in-depth descriptions found in books, bibliographies and research material published elsewhere.</p><p></p><p></p><p>Otherwise, carry on,</p><p></p><p></p><p>Thanks,<br>Thomas</p>", "indent": 0, "name": "Thomas L", "date": "2009-10-19T21:04:54Z", "path": "/2009/access-and-description-reconsidered/", "order": "002512145112"}, {"comment": "<p>Cool, Hillel, I agree.  I didn't make distinctions between archivists. @Jane Stevenson implied the distinction, and I ran with it.  I do want to debate the issue of archival description, however, and therefore appreciate your comment.  There is no thinly veiled attack in my comments, rather, a plea for information.</p>", "indent": 0, "name": "Thomas L", "date": "2009-11-03T23:32:41Z", "path": "/2009/access-and-description-reconsidered/", "order": "002512145100"}, {"comment": "<p>So, I understand how my comment above might be the cause of some confusion.  Perhaps, therefore, you could respond, or react, to the two following questions.</p><p></p><p></p><p>In your current position of \"Applications Developer in the Digital Experience Group of the New York Public Library\"...</p><p></p><p></p><p>1) To which archival collections have you added a description? </p><p></p><p></p><p>2) Of those archival collections described, how many researchers working with them have you assisted?</p><p></p><p></p><p>I wonder about these questions because your blog post is about both access and description. </p><p></p><p></p><p>And, again, carry on,<br>Thomas L</p>", "indent": 0, "name": "Thomas L", "date": "2009-10-22T09:26:28Z", "path": "/2009/access-and-description-reconsidered/", "order": "002512145111"}, {"comment": "<p>@Thomas L, I don't really understand your point(s) in your comments above, and in fact I'm wondering if you have one besides leveling thinly veiled personal attacks at Mark.</p><p></p><p></p><p>Debating who or what is a \"real archivist\" versus an \"information peddler\" (and implying that Mark is the latter and therefore not the former) seems to me a useless and immature conversation. I'm sure you will agree that our profession is not served by petty infighting or name-calling.</p>", "indent": 0, "name": "Hillel", "date": "2009-11-03T20:27:56Z", "path": "/2009/access-and-description-reconsidered/", "order": "002512145093"}, {"comment": "<p>Though not exactly how I would describe the binary, I do like this distinction @Jane Stevenson creates between \"real archivists\" and those \"just peddling and meddling with archival description.\"  If the latter are not adding any original description, and not even working with actual collections, a parasitic relationship can result.</p><p></p><p></p><p>The hope of the archival description peddler then becomes to remove data created by real archivists and upload and rearrange it via new, ever-changing networks.  This is excellent and yields some interesting work.  But at the level of practice, will be best achieved by actual web / database designers, and not folks a few years out of Library school.</p><p></p><p></p><p>I will argue that most user of archives, find archives through books and humanities research.  Usage is the result of critical thinking and bibliographic analysis.   These patrons are also working to create new works in the humanities and social science.  As mentioned above, description peddlers are rarely seen using archives.  Thus, the work of the description peddler is fine and dandy in so far as everyone at the table is a technologist.  But they're achievements are lost on a good number of people who simply want to get to collections which they know to exist.  Box 13, so to speak, of a 133 Box collection.</p><p></p><p></p><p>Nothing will change, but there is risk of real archivists erasing their professional standing in the humanities by adopting the philosophy of description peddlers.</p><p></p><p></p><p>Again, as usual, carry on, <br>Thomas</p>", "indent": 0, "name": "Thomas L", "date": "2009-11-02T21:44:17Z", "path": "/2009/access-and-description-reconsidered/", "order": "002512145092"}, {"comment": "<p>I would again recommend a buncha stuff written by David Bearman on this topic, maybe ten or more years ago.</p>", "indent": 0, "name": "Jonathan Rochkind", "date": "2009-10-16T10:25:26Z", "path": "/2009/access-and-description-reconsidered/", "order": "002512145107"}], "/2009/coming-soon-drupal-for-archivists/": [{"comment": "<p>Great idea, looking forward to it.</p>", "indent": 0, "name": "Jonathan Rochkind", "date": "2009-03-24T07:47:55Z", "path": "/2009/coming-soon-drupal-for-archivists/", "order": "002512145066"}], "/2008/dylan-in-tei/": [{"comment": "<p>What's chiefly going on in the movie is movement of Dylan's head, as he shifts his gaze from the camera, to offscreen, to the placard, and of course of his hands as he exposes the next placard. The only way I can think of combining all those changes with the soundtrack would be by time alignment, rather than facs.</p>", "indent": 0, "name": "Lou", "date": "2008-10-02T18:20:49Z", "path": "/2008/dylan-in-tei/", "order": "002512145007"}, {"comment": "<p>Hi Lou - This isn't a bad idea, and wouldn't be difficult to implement given that the cards don't actually move around on the screen during the course of the video. I'm fairly sure that's why I didn't do this, actually, there would be just one  attached to each caption. The major variance throughout the video is the cards switching out, which happens in time rather than in space. More useful to attach time stamps to the captions rather than using facsimile in this instance, surely?</p><p></p><p></p><p>Now, if there were a lot going on in the background, using facsimile (plus timestamps) to mark descriptions of what is going on <em>would</em> be quite interesting and potentially useful... but this is a very static example.</p>", "indent": 0, "name": "Dot", "date": "2008-10-02T09:03:45Z", "path": "/2008/dylan-in-tei/", "order": "002512145004"}, {"comment": "<p>Hi Lou -- you're right, there are a number of ways to do this.  Dot and I discussed quite a few options, but only implemented the one so far, which focuses on the textual presence in the video.  Care to give it a shot, using the facsimile features?</p><p></p><p></p><p>Discussion at <a href=\"http://etcl.uvic.ca/tei\" rel=\"nofollow noopener\" title=\"http://etcl.uvic.ca/tei\">http://etcl.uvic.ca/tei</a></p>", "indent": 0, "name": "Ray", "date": "2008-10-02T04:18:20Z", "path": "/2008/dylan-in-tei/", "order": "002512145012"}, {"comment": "<p>Ray, nice idea, but why didn't you do a real transcript of the song,  a proper transcript of the movie captions, (using the new facsimile features), and show how TEI can be used to link them together?  That would be a real advertisement for the TEI: this just looks gimmicky.</p>", "indent": 0, "name": "Lou", "date": "2008-10-02T01:01:57Z", "path": "/2008/dylan-in-tei/", "order": "002512145010"}], "/2010/aus-archivists-listserv-update/": [{"comment": "<p>So with a traditional listserv, the actual 'archives' are pretty amenable to preservation. They are a well-known, simple, standardized format. You just say, hey, provider, give me those mbox files please, and you have a number of ways to deal with them to allow access.  Ideally, if the 'archives' are important to you, you get a dump from the provider periodically, so if hte provider disappears without notice you've still got most of it.</p><p>With Ning... how likely is it that the discussions of archivists be preserved for posterity? Can you get a dump from Ning at all?</p>", "indent": 0, "name": "Jonathan Rochkind", "date": "2010-11-19T03:47:02Z", "path": "/2010/aus-archivists-listserv-update/", "order": "002512145173"}, {"comment": "<p>Thanks for the updates, Mark. GMANE would be good folks to interest in mirroring the archive -- they have better interfaces than most.</p><p>When I hear \"we'll put it on our website\" I hear -- \"it may be trapped in zillions of different files\".</p><p>Why not also provide the dump of the listserv to one or several external organizations? Multiple copies is the only way to keep stuff in the long run.</p>", "indent": 0, "name": "Jodi Schneider", "date": "2010-11-21T19:43:30Z", "path": "/2010/aus-archivists-listserv-update/", "order": "002512145169"}, {"comment": "<p>Jonathan, I know that Ning network creators can export content from their network using a client or an API, but I don't know about network participants.</p>", "indent": 0, "name": "Mark A. Matienzo", "date": "2010-11-19T08:26:01Z", "path": "/2010/aus-archivists-listserv-update/", "order": "002512145176"}], "/2008/deliciouscopy-a-dumb-solution-for-a-dumb-problem/": [{"comment": "<p>That's probably pretty easy. Start bugging me come Saturday and maybe I'll start working on it... :)</p>", "indent": 0, "name": "Mark A. Matienzo", "date": "2008-12-04T21:37:47Z", "path": "/2008/deliciouscopy-a-dumb-solution-for-a-dumb-problem/", "order": "002512145033"}, {"comment": "<p>I don't have feedback - but rather have another idea for a piece of code I wish existed. I want a plugin that will harvest all the links I put into a Wordpress post, create a Delicious bookmark for each and tag that bookmark with the tags and categories assigned to the Wordpress post. Maybe could include a link back to the original post in the notes of the bookmark - but that would be gravy. </p><p></p><p></p><p>Hard or easy? Intriguing enough to bug you until you build it?</p>", "indent": 0, "name": "Jeanne", "date": "2008-12-04T21:24:25Z", "path": "/2008/deliciouscopy-a-dumb-solution-for-a-dumb-problem/", "order": "002512145028"}], "/2018/004/quake/": [{"comment": "<p>Manual, so far. I think <a href=\"https://toot.cat/@rhiaro\" rel=\"nofollow noopener\" title=\"https://toot.cat/@rhiaro\">@rhiaro@toot.cat</a> might have some way to POSSE from her site to Mastodon.</p>", "indent": 1, "name": "Mark A. Matienzo", "date": "2018-01-07T12:00:41Z", "path": "/2018/004/quake/", "order": "003694579911,003695914330"}, {"comment": "<p>Hey there Mark! Just out of curiosity did you manually cross post this to <a href=\"https://chaos.social/@anarchivist/99294237499617350\" rel=\"nofollow noopener\" title=\"https://chaos.social/@anarchivist/99294237499617350\">https://chaos.social/@anarc...</a> or are you experimenting with <a href=\"https://indieweb.org/POSSE\" rel=\"nofollow noopener\" title=\"https://indieweb.org/POSSE\">POSSE</a> by any chance?</p>", "indent": 0, "name": "Ed Summers", "date": "2018-01-06T13:48:35Z", "path": "/2018/004/quake/", "order": "003694579911"}], "/2009/this-is-all-im-going-to-say-on-this-here-blogsite-concerning-the-brouhaha-about-the-policy-for-use-and-transfer-of-worldcat-records-because-i-have-other-more-interesting-and-more-complex-problems-t/": [{"comment": "<p>I think you're missing the point here. The issue isn't MARC records per se, or how much you hate them. </p><p></p><p></p><p>First, the Policy is quite clear that any data derived from \"OCLC's\" MARC records is equally subject to the Policyâ€”so, for example, RDA is \"born owned\" whether or not OCLC takes the least bit of interest. </p><p></p><p></p><p>But more importantly the library world are the colonists, and the MARC records are tea. The issue isn't this or that technology, but the entire future of data monopoly and ask-first-make-later permission. Nobody cares what version of Windows was the first to disable competitors' products, or what the products were--probably they were defending themselves against a better Clippy. The issue isn't that, but the whole future of restriction and compromise that emerged from Microsoft's monopolies. </p><p></p><p></p><p>In the future OCLC may well let you have your API. Just fill out a record use form in triplicate, be sure you have support from your institution and certify that your maps API poses no threat to their core business model or any products they may want to develop. Is that good enough for you, or do you think you ought to be able to develop interesting applications for public data on your own authority?</p>", "indent": 0, "name": "Tim", "date": "2009-01-17T15:39:47Z", "path": "/2009/this-is-all-im-going-to-say-on-this-here-blogsite-concerning-the-brouhaha-about-the-policy-for-use-and-transfer-of-worldcat-records-because-i-have-other-more-interesting-and-more-complex-problems-t/", "order": "002512145044"}, {"comment": "<p>I'm not missing the point as I understand the policy quite well, and I understand and respect that if I'm going to have to use someone's API that I'll have to follow their terms. If I think the terms are too restrictive I won't use the API.</p>", "indent": 1, "name": "Mark A. Matienzo", "date": "2009-01-17T22:19:19Z", "path": "/2009/this-is-all-im-going-to-say-on-this-here-blogsite-concerning-the-brouhaha-about-the-policy-for-use-and-transfer-of-worldcat-records-because-i-have-other-more-interesting-and-more-complex-problems-t/", "order": "002512145044,002512145211"}, {"comment": "<p>Well, that proves the point, doesn't it? The Policy is not a terms of service to an API at all, neither legally or in effect. Legally it's a membership agreement to a cooperative organization. In effect it is the privatization of a cooperative and of data, most of which was created with taxpayer money.</p><p></p><p></p><p>The Policy is about whether OCLC can grow up as a cooperative and then turn itself into a monopoly, locking down data no matter when it was made, who made it or what API they use to get it. To qualify the record merely has to have been at some point transfered through WorldCat, or \"derived\" from a record which was so transferred. It converts some 95% of all English-language cataloging records into a private possession. The analogy isn't Amazon or Yahoo opening up an API and setting terms. It's the water company deciding that it can tell you when to drink and, because you drank water in the past, it gets a veto over all your actions.</p>", "indent": 0, "name": "Tim", "date": "2009-01-18T15:06:45Z", "path": "/2009/this-is-all-im-going-to-say-on-this-here-blogsite-concerning-the-brouhaha-about-the-policy-for-use-and-transfer-of-worldcat-records-because-i-have-other-more-interesting-and-more-complex-problems-t/", "order": "002512145043"}], "/2009/must-contextual-description-be-bound-to-records-description/": [{"comment": "<p>It's nice to see this discussion revived. You'll note Dick Lytle and I tried to get this segregatiuon introduced in 1985 ( \"The Power of the Principle of Provenance\", Archivaria, #21, p.14-27) See <a href=\"http://journals.sfu.ca/archivar/index.php/archivaria\" rel=\"nofollow noopener\" title=\"http://journals.sfu.ca/archivar/index.php/archivaria\">http://journals.sfu.ca/arch...</a>.<br>Later, I opposed EAD when it was being introduced largely for this reason (and the fact that it was in effect a kind of typographical rather than logical mark-up).<br>The current wiki/web 2.0 environment makes the collective construction of the authority apparatus so much easier and argues for the right architecture. I hope you succeed.</p>", "indent": 0, "name": "David Bearman", "date": "2009-08-18T23:12:25Z", "path": "/2009/must-contextual-description-be-bound-to-records-description/", "order": "002512145088"}, {"comment": "<p>What about archivists who like to tailor the  specifically to the collection description? Would it be appropriate to have a small collection of a couple of letters that links to a full biographical history? I'm undecided on this, but my inclination is to favour (or favor!) the efficiencies that come from using one biographical history.</p>", "indent": 0, "name": "Jane Stevenson", "date": "2009-09-22T14:06:38Z", "path": "/2009/must-contextual-description-be-bound-to-records-description/", "order": "002512145076"}, {"comment": "<p>I guess something else I'm picking up on is this sort of thing at least should make archivists more interested in FRBR. I'll be the first to admit that FRBR Group 1 entities tend to get ontologically sticky when you consider a fonds and its parts â€“ either something being at once a Work, Expression, Manifestation and Item (e.g. an otherwise unpublished letter), and something quite different, like a hand-annotated version of a screenplay for a movie that's been remade several times. However, Group 2 and Group 3 entities in part help to establish context, and the essential role of relationships between those entities fits nicely with the work being done, for example, on EAC-CPF.</p><p></p><p></p><p>Australian and New Zealand libraries and archives  do often seem to be worlds ahead of us. I've asked a few colleagues from that part of the world why (informally) they think this is the case - people like <a href=\"http://discontents.com.au/\" rel=\"nofollow noopener\" title=\"http://discontents.com.au/\">Tim Sherratt</a> at the National Archives of Australia, and Virginia Gow of the <a href=\"http://www.digitalnz.org/\" rel=\"nofollow noopener\" title=\"http://www.digitalnz.org/\">DigitalNZ project</a>. The overall opinion seems to be that it's in part due to their relatively recent history as independent nations, as well as the relatively recent history of national libraries and archives in those countries. To me, this also suggests the possibilities of the professional practice being less entrenched than, say, in the United States.</p><p></p><p></p><p>As far as David Bearman goes, he's still causing a ruckus, albeit not directly in the archives world anymore; <a href=\"http://www.archimuse.com/consulting/bearman.html\" rel=\"nofollow noopener\" title=\"http://www.archimuse.com/consulting/bearman.html\">he's still active</a> with his consulting firm, <a href=\"http://www.archimuse.com/\" rel=\"nofollow noopener\" title=\"http://www.archimuse.com/\">Archives and Museum Informatics</a>, most notable in part for organizing the <a href=\"http://www.archimuse.com/conferences/mw.html\" rel=\"nofollow noopener\" title=\"http://www.archimuse.com/conferences/mw.html\">Museums and the Web conferences</a> these days.</p>", "indent": 0, "name": "Mark A. Matienzo", "date": "2009-08-01T03:17:56Z", "path": "/2009/must-contextual-description-be-bound-to-records-description/", "order": "002512145071"}, {"comment": "<p>I get what you're saying, but when I have multiple finding aids with the same records creator (i.e. let's say, an organization's archives, and I don't want to create one humongous finding aid), I copy and paste the same information in the bioghist note and then in certain circumstances I will modify the note based on the collection I'm describing--you know, emphasize some historical points, de-emphasize other stuff.  In other words, the collection's contents have direct bearing on the contextual information.</p><p></p><p></p><p>However, most of the time I do wish that at least part of this information--like, the boilerplate concerning the administrative history of the organization--could be managed elsewhere, and then somehow imported into/linked to finding aids, which is where I'm hoping EAC-CPF will come in.  But that's coming from someone who has never even seen the schema, so I'm looking forward to checking it out in the coming weeks.</p>", "indent": 0, "name": "jordon", "date": "2009-08-01T06:07:02Z", "path": "/2009/must-contextual-description-be-bound-to-records-description/", "order": "002512145072"}, {"comment": "<p>Jordon, I guess that's my point - should we really be bothering to emphasize/de-emphasize that within the finding aid proper? I'm really starting to think they should be strictly separated. </p><p></p><p></p><p>Your second point, though, is really what's behind the grand vision for EAC-CPF. The problem is (as I've <a href=\"http://thesecretmirror.com/description/dead-reckoning-2\" rel=\"nofollow noopener\" title=\"http://thesecretmirror.com/description/dead-reckoning-2\">written before</a>) that EAD isn't namespace-enabled, meaning you can't arbitrarily pull in elements from other metadata schemas. EAC-CPF, however, has this baked into the schema itself. In part, this is a big reason why I (as well as others) have been calling for the revision of EAD.</p>", "indent": 0, "name": "Mark A. Matienzo", "date": "2009-08-01T06:53:55Z", "path": "/2009/must-contextual-description-be-bound-to-records-description/", "order": "002512145075"}, {"comment": "<p>I get what you're saying, and this is kind of what I was trying to allude to with noting that FRBR Group 1 entities considered in an archival context gets ontologically sticky. I really don't think part/whole relationships are an exact fit with the driving principle behind multi-level arrangement and description of a fonds. I think there is very important ontological distinction between, e.g., a multi-volume monograph, or a website and its components (as suggested in Barbara Tillett's <a href=\"http://www.loc.gov/cds/downloads/FRBR.PDF\" rel=\"nofollow noopener\" title=\"http://www.loc.gov/cds/downloads/FRBR.PDF\">What Is FRBR?</a> [PDF]), versus a body of records created organically by a corporate body processed by an archivist. It just seems flat out wrong to me to say that a fonds, sous-fonds, series, etc. is one of the Group 1 entities â€” rather, only an <strong>i</strong>tem can every be an instance of one of those entities.</p>", "indent": 0, "name": "Mark A. Matienzo", "date": "2009-08-01T04:12:53Z", "path": "/2009/must-contextual-description-be-bound-to-records-description/", "order": "002512145081"}, {"comment": "<p>Oh, and PS:, I remember being captivated by the writings of David Bearman in that archives class, he seemed to get it about doing archival metadata right. I asked the professor (a professional archivist) \"What happened to him and his ideas, anyway?\".  He said \"Eh, he got frustrated that everyone just ignored him, and went and did something else.\"</p><p></p><p></p><p>Some day, that too can be you and me! heh. </p><p></p><p></p><p>And no, I don't see any reason for contextual metadata to be in a metadata record for a particular archival record set, for the main reason that that contextual metadata is gonna often end up duplicated across multiple archival record sets, aint' it?</p>", "indent": 0, "name": "Jonathan Rochkind", "date": "2009-08-01T01:45:14Z", "path": "/2009/must-contextual-description-be-bound-to-records-description/", "order": "002512145079"}, {"comment": "<p>Is this different in European archival practice? In my vague memories of the archives class I took in library school (which, much like every other class I took involving library metadata, involved me asking \"Wait, why the heck do you do THAT\", and professionals getting exasperated with me -- a fine preparation for my professional career!), anyway, in my memory, I thought we got that from European tradition in the first place, and they do it even more than us?</p><p></p><p></p><p>Ah, but I bet Australian/New Zealand does it better. They seem to do everything related to archival description for the contemporary world a couple decades ahead of us.</p>", "indent": 0, "name": "Jonathan Rochkind", "date": "2009-08-01T01:33:28Z", "path": "/2009/must-contextual-description-be-bound-to-records-description/", "order": "002512145078"}, {"comment": "<p>Whole/part relationships still haven't been adequately modelled by FRBR type stuff, and that's often what (I think?) you need with traditional archival description. </p><p></p><p></p><p>But there's nothing odd with \"something being at once a Work, Expression, Manifestation and Item\"  -- that is indeed true of any unique (rather than mass produced/copied) item, and there's nothing too tricky about it.  I've suggested before (<a href=\"http://bibwild.wordpress.com/2007/12/07/frbr-considered-as-set-relationships/)\" rel=\"nofollow noopener\" title=\"http://bibwild.wordpress.com/2007/12/07/frbr-considered-as-set-relationships/)\">http://bibwild.wordpress.co...</a> it's useful to think of the FRBR Group 1 Entities as set relationships. So the workset consists of only one expression which consists of only one manifestation which consists of only one item. Maybe a bit of extra apparatus for a unique item, but no problem!</p><p></p><p></p><p>But, hey, as soon as you digitize that unique unpublished letter, you've got another manifestation. And as soon as some scholar translates the letter, you've got another expression.  The apparatus is there waiting for when it's needed, whether archival description practice will use it or not, somebody will. </p><p></p><p></p><p>But the hand annotated screenplay gets into the trickiness of whole-part relationships again that FRBR isn't very good at, it needs to be fleshed out how to model it.  Compare to a traditional published collection/anthology of individual items that may be  previously or subsequently published independently. You've got multiple different works (each item)... published together in one single manifestation, and creating a new work representing the aggregate?  That's how I'd choose to model it, but I'm not sure this is consensus. The annotated screenplay is actually quite similar, I'd call the annotations one work, and the screenplay another, coming together to form a manifestation of a new aggregate work (no matter that it's a work with only one expression and annotation... for now, until someone digitizes it or translates it!)</p>", "indent": 0, "name": "Jonathan Rochkind", "date": "2009-08-01T03:48:10Z", "path": "/2009/must-contextual-description-be-bound-to-records-description/", "order": "002512145086"}], "/2008/dataportabilityorg-and-the-dream-of-a-web-20-backup-system/": [{"comment": "<p>I don't have anything specific to contribute, but count me in.  I should have a few spare cycles for what they're worth. :)</p>", "indent": 0, "name": "Mike Giarlo", "date": "2008-01-30T08:13:22Z", "path": "/2008/dataportabilityorg-and-the-dream-of-a-web-20-backup-system/", "order": "002512144988"}], "/2006/syndicating-archives-blogs/": [{"comment": "<p>I am willing to play around with Planet for the heck of it. I know Drupal has this functionality so that would make sense. I actually meant to mention SIclops in this, too, but it slipped my mind. If Planet can easily import/export something like OPML, then getting it to play nicely with other community portals/CMS instances would be pretty easy too.</p>", "indent": 0, "name": "Mark A. Matienzo", "date": "2006-08-15T01:16:46Z", "path": "/2006/syndicating-archives-blogs/", "order": "002512144937"}, {"comment": "<p>I've set up a sample Planet instance at <a href=\"http://thesecretmirror.com/planet/\" rel=\"nofollow noopener\" title=\"http://thesecretmirror.com/planet/\">http://thesecretmirror.com/...</a> .  It's just got two blogs at the moment (mine and <a href=\"http://archivemati.ca\" rel=\"nofollow noopener\" title=\"archivemati.ca\">archivemati.ca</a>). It can export to just about anything (RSS, OPML, HTML) since it's designed to run on templates. It's pretty fast, I guess. The script isn't run from the web - it needs to be called via cron.</p>", "indent": 0, "name": "Mark A. Matienzo", "date": "2006-08-15T19:31:45Z", "path": "/2006/syndicating-archives-blogs/", "order": "002512144940"}, {"comment": "<p>SIclops is going to move soon, to where it will stay (and split into a development and production sites), but is currently: <a href=\"http://si.umich.edu/saa/siclops/\" rel=\"nofollow noopener\" title=\"http://si.umich.edu/saa/siclops/\">http://si.umich.edu/saa/sic...</a></p><p>If you start playing around with Planet, I'd like to see any documentation of your efforts that you're willing to put out there.  It was what I was originally going to use after seeing it in effect at <a href=\"http://www.slisblogs.com\" rel=\"nofollow noopener\" title=\"http://www.slisblogs.com\">http://www.slisblogs.com</a>.</p>", "indent": 0, "name": "Andrew Bangert", "date": "2006-08-15T01:25:22Z", "path": "/2006/syndicating-archives-blogs/", "order": "002512144941"}, {"comment": "<p>I had been planning to do this with Drupal (because I don't know how to set up Planet and because using Drupal would mean it could easily be extended to offer other staples of online community).  I would have set it up for SAA if there had been wireless.   I'm about to have some time on my hands...</p>", "indent": 0, "name": "Andrew Bangert", "date": "2006-08-15T01:05:46Z", "path": "/2006/syndicating-archives-blogs/", "order": "002512144926"}, {"comment": "<p>For a Drupal example, I've been aggregating most of those blogs for our chapter of SAA (the rest of the site needs some work):<br><a href=\"http://si.umich.edu/saa/?q=archivists\" rel=\"nofollow noopener\" title=\"http://si.umich.edu/saa/?q=archivists\">http://si.umich.edu/saa/?q=...</a></p>", "indent": 0, "name": "Andrew Bangert", "date": "2006-08-15T01:20:40Z", "path": "/2006/syndicating-archives-blogs/", "order": "002512144938"}], "/2006/the-state-of-open-source-archival-management-software/": [{"comment": "<p>See <a href=\"http://archiv.twoday.net/stories/3095358/\" rel=\"nofollow noopener\" title=\"http://archiv.twoday.net/stories/3095358/\">http://archiv.twoday.net/st...</a></p>", "indent": 0, "name": "Klaus Graf", "date": "2006-12-22T05:38:11Z", "path": "/2006/the-state-of-open-source-archival-management-software/", "order": "002512144974"}], "/2009/bpl-in-nytimes/": [{"comment": "<p>Another interesting story about Brooklyn Public Library is in Library Journal: </p><p></p><p></p><p><a href=\"http://www.libraryjournal.com/article/CA6677263.html\" rel=\"nofollow noopener\" title=\"http://www.libraryjournal.com/article/CA6677263.html\">http://www.libraryjournal.c...</a></p><p></p><p></p><p>Evidently, Brooklyn Public Library thought it would be a GOOD idea to PUBLICIZE its layoffs and invited the Washington Post to view employees getting laid off. The Washington Post recorded intimate details and printed them in \"The Art of Letting Employees go\" on August 9, 2009. It was just like one of those cheap reality TV shows. </p><p></p><p></p><p><a href=\"http://www.washingtonpost.com/wp-dyn/content/article/2009/08/08/AR2009080802659.html\" rel=\"nofollow noopener\" title=\"http://www.washingtonpost.com/wp-dyn/content/article/2009/08/08/AR2009080802659.html\">http://www.washingtonpost.c...</a></p>", "indent": 0, "name": "Keep Reading", "date": "2009-08-24T20:56:17Z", "path": "/2009/bpl-in-nytimes/", "order": "002512145106"}, {"comment": "<p>Hello,<br>    I wonder if you can empathize with [name redacted].<br>Her privacy is lost. Is it possible you can remove her name from your blog post and start a new post. The issue is major and you raise important privacy concerns. But in so doing you are also hurting someone else.</p><p></p><p></p><p>Forever grateful<br>Mary</p>", "indent": 0, "name": "MARY JOE", "date": "2009-08-26T12:36:37Z", "path": "/2009/bpl-in-nytimes/", "order": "002512145104"}, {"comment": "<p>Thank you for redacting out the name above.</p><p></p><p></p><p>Best regards,<br>Mary</p>", "indent": 0, "name": "MARY JOE", "date": "2009-08-27T02:24:30Z", "path": "/2009/bpl-in-nytimes/", "order": "002512145102"}, {"comment": "<p>The law does not protect anonymity. It protects privacy in certain circumstances.<br>What's going to happen to [name redacted - ed.] if her name appears on a website?</p>", "indent": 0, "name": "Janon Fisher", "date": "2009-08-20T19:50:23Z", "path": "/2009/bpl-in-nytimes/", "order": "002512145090"}], "/2010/dlist-downtime/": [{"comment": "<p>Jeremy, thanks for the update! I appreciate the info.</p>", "indent": 0, "name": "Mark A. Matienzo", "date": "2010-03-12T02:16:05Z", "path": "/2010/dlist-downtime/", "order": "002512145154"}, {"comment": "<p>Tha answer may lie in our \"social expectation.\" What are our social expectations and can they sustain OAs? Although I am not familiar with the situation other than what I read, it seems that both DLIST and Mana'o OA were impacted by the social reality of time and money. I believe that information wants to be free...but at what cost?</p>", "indent": 0, "name": "John", "date": "2010-03-11T21:31:17Z", "path": "/2010/dlist-downtime/", "order": "002512145152"}, {"comment": "<p>So, a quick status update on DLIST - it's in the process of being brought back up, though it will likely be a couple of weeks. Once it is back up, it will be maintained as part of the University of Arizona Libraries' overall repository and digital preservation efforts, which should minimize this sort of downtime in the future. (On the technical side, it will be migrated from an EPrints 3.x installation to our DSpace instance here at the UA).</p>", "indent": 0, "name": "Jeremy Frumkin", "date": "2010-03-12T01:13:53Z", "path": "/2010/dlist-downtime/", "order": "002512145148"}], "/2009/the-archival-the-irreconcilable-and-the-unwebbable/": [{"comment": "<p>They arenâ€™t â€œvisual aids.â€\u009d They are categories of illustrations or graphics that would translate poorly to HTML semantics.</p>", "indent": 0, "name": "Joe Clark", "date": "2009-07-24T22:16:34Z", "path": "/2009/the-archival-the-irreconcilable-and-the-unwebbable/", "order": "002512145069"}, {"comment": "<p>Thanks for the correction, Joe!</p>", "indent": 0, "name": "Mark A. Matienzo", "date": "2009-07-24T22:19:33Z", "path": "/2009/the-archival-the-irreconcilable-and-the-unwebbable/", "order": "002512145074"}], "/2007/nara-frees-their-data-somewhat/": [{"comment": "<p>Hi Mark,</p><p>I know this is a little late, but just fyi after reading this post I wrote to someone I know back at NARA who would be a in position to know about this and to make a public comment about it. Never got a reply. But, hey, I tried.</p><p>Ciao!</p><p>Kate</p>", "indent": 0, "name": "ArchivesNext", "date": "2007-06-08T22:18:14Z", "path": "/2007/nara-frees-their-data-somewhat/", "order": "002512144982"}], "/2009/structured-archival-thesauri/": [{"comment": "<p>Hi, there are available an TemaTres version of Thesaurus for Use in College and University Archives at <a href=\"http://vocabularyserver.com/archivethesaurus/\" rel=\"nofollow noopener\" title=\"http://vocabularyserver.com/archivethesaurus/\">http://vocabularyserver.com...</a></p>", "indent": 0, "name": "diego", "date": "2010-05-31T19:26:08Z", "path": "/2009/structured-archival-thesauri/", "order": "002512145059"}, {"comment": "<p>Since we are in the internet, I would like to suggest trying to make a multi-lingual one like Eurovoc.</p><p></p><p></p><p>Of cause, their software might not suitable for us, however, some kinds of wikipedia setup will likely work.</p><p></p><p></p><p>I think make a start on English. Setup the goal and guidelines, then make a small test. </p><p></p><p></p><p>It will be very very useful.</p>", "indent": 0, "name": "kentsin", "date": "2009-03-04T14:24:15Z", "path": "/2009/structured-archival-thesauri/", "order": "002512145053"}, {"comment": "<p>Maybe you can post it via a TemaTres install? <a href=\"http://www.r020.com.ar/tematres/index.en.html\" rel=\"nofollow noopener\" title=\"http://www.r020.com.ar/tematres/index.en.html\">http://www.r020.com.ar/tema...</a></p><p></p><p></p><p>TemaTres provides all the elements you need for a thesaurus along with providing full export in Zthes (XML), SKOS-Core (RDF) and Topic Map. There is also some sort of Web Service available (though service spec is still only in Spanish).</p>", "indent": 0, "name": "Jeanne Kramer-Smyth", "date": "2009-02-22T09:04:32Z", "path": "/2009/structured-archival-thesauri/", "order": "002512145051"}, {"comment": "<p>Awesome idea ... lets make this happen at <a href=\"http://code4lib.org/2009\" rel=\"nofollow noopener\" title=\"http://code4lib.org/2009\">c4l09</a>?</p>", "indent": 0, "name": "Ed Summers", "date": "2009-02-21T20:46:40Z", "path": "/2009/structured-archival-thesauri/", "order": "002512145050"}, {"comment": "<p>That's what I like to hear, Ed!</p>", "indent": 0, "name": "Mark A. Matienzo", "date": "2009-02-21T20:49:30Z", "path": "/2009/structured-archival-thesauri/", "order": "002512145055"}, {"comment": "<p>Mark Matienzo took the simple expedient of asking... and the answer is yes.</p>", "indent": 0, "name": "Kate Bowers", "date": "2009-02-24T05:35:19Z", "path": "/2009/structured-archival-thesauri/", "order": "002512145054"}, {"comment": "<p>It's nice to see continued interest in the thesaurus.  Please keep your eyes on the publisher, the Society of American Archivists, for developments.</p>", "indent": 0, "name": "Kate Bowers", "date": "2009-03-29T06:08:18Z", "path": "/2009/structured-archival-thesauri/", "order": "002512145062"}, {"comment": "<p>I found this initiative to do that from Society of American Archivists Records Management Roundtable: <a href=\"http://mdrive.lib.byu.edu/tematres/index.php\" rel=\"nofollow noopener\" title=\"http://mdrive.lib.byu.edu/tematres/index.php\">Functions Thesaurus</a>, a Thesaurus for functions related to records management and archives.</p>", "indent": 0, "name": "diego", "date": "2009-09-30T20:36:57Z", "path": "/2009/structured-archival-thesauri/", "order": "002512145063"}, {"comment": "<p>Hi, my name is diego and I'm tematres developer :-). May be I can aid... but I need an formal or idented version of thesarus. There are one?</p><p></p><p></p><p>For test, tematres 1.03 is available for TemaTres: <a href=\"http://www.r020.com.ar/tematres/tematres1.03.zip\" rel=\"nofollow noopener\" title=\"http://www.r020.com.ar/tematres/tematres1.03.zip\">http://www.r020.com.ar/tema...</a></p><p></p><p></p><p>Some examples of web services exploit: <a href=\"http://www.r020.com.ar/tematres/wiki/doku.php\" rel=\"nofollow noopener\" title=\"http://www.r020.com.ar/tematres/wiki/doku.php\">http://www.r020.com.ar/tema...</a></p>", "indent": 0, "name": "diego", "date": "2009-03-27T21:46:21Z", "path": "/2009/structured-archival-thesauri/", "order": "002512145060"}, {"comment": "<p>I found  this initiative to do that from  Society of American Archivists Records Management Roundtable: <a href=\"http://mdrive.lib.byu.edu/tematres/index.php\" rel=\"nofollow noopener\" title=\"http://mdrive.lib.byu.edu/tematres/index.php\">http://mdrive.lib.byu.edu/t...</a></p>", "indent": 0, "name": "diego", "date": "2009-09-30T20:35:42Z", "path": "/2009/structured-archival-thesauri/", "order": "002512145064"}], "/2008/idle-hands-are-the-devils-plaything/": [{"comment": "<p>Hi Mark, </p><p></p><p></p><p>Welcome aboard as Standards SIG chair,  I look forward to seeing what you have in store for us at MCN 2009!</p><p></p><p></p><p>(waves hello @ Jodi)</p>", "indent": 0, "name": "Richard", "date": "2008-12-04T02:21:35Z", "path": "/2008/idle-hands-are-the-devils-plaything/", "order": "002512145022"}, {"comment": "<p>Congrats on the ISSN, Mark! I wonder why WorldCat says \"Sorry, no libraries with the specified item were found.\" instead of \"Great choice, get it <a href=\"http://thesecretmirror.com/\" rel=\"nofollow noopener\" title=\"http://thesecretmirror.com/\">on the web</a>.\"</p>", "indent": 0, "name": "Jodi Schneider", "date": "2008-11-28T02:09:23Z", "path": "/2008/idle-hands-are-the-devils-plaything/", "order": "002512145018"}], "/2006/archivesblogs-news-disappearing-blogspot-blogs/": [{"comment": "<p>Yes, we want to be back on syndication!</p>", "indent": 0, "name": "Elizabeth Keathley", "date": "2006-08-31T03:05:41Z", "path": "/2006/archivesblogs-news-disappearing-blogspot-blogs/", "order": "002512144957"}], "/2007/saa-listserv/": [{"comment": "<p>Mark, that's a good point about the violation of the two-year retention motion. You should send that to SAA executive officers and the A&amp;A list.</p>", "indent": 0, "name": "Anonymous", "date": "2007-03-15T21:11:49Z", "path": "/2007/saa-listserv/", "order": "002512144983"}, {"comment": "<p>Thanks for blogging about this Mark. It does seem totally absurd. I certainly don't understand the financial concerns when the listserv mbox data could be dumped into something <a href=\"http://mail-archive.com\" rel=\"nofollow noopener\" title=\"http://mail-archive.com\">mail-archive</a>.</p><p>Nice job in your <a href=\"http://forums.archivists.org/read/messages?id=3413\" rel=\"nofollow noopener\" title=\"http://forums.archivists.org/read/messages?id=3413\">response</a> on the discussion list as well. I'll be looking to your blog to hear how this develops.</p>", "indent": 0, "name": "Ed Summers", "date": "2007-03-14T14:34:20Z", "path": "/2007/saa-listserv/", "order": "002512144981"}], "/2008/slaying-the-scary-monsters/": [{"comment": "<p>Mark,<br>You make some really interesting points. I think it is especially hard when new teams are created with staff with a variety of skill sets and equally various backgrounds. I am not sure software has much to do with it. Seems to me that teams form in stages and that a lot of the early work is learning how to best work together. However, I am assured by a whole host of Operations Research folks that the most self-sufficient, productive and satisfied teams are those that are comprised of members who represent a  wide variety of talents and who are willing to work through the initial rough patches. <br>I agree that project management plays a key role in work flow and information sharing but I also think that not all teams need managers in the sense that the phrase \"project management\" suggests. Some teams need more guidance than others and some teams need no management guidance at all. <br>I am sympathetic to your desire for control over the process. So one of the things we all need to do is get together and talk about the needs of the various players in DEG and see if we can come up with a variety of tools that can help meet all our needs. --bt</p>", "indent": 0, "name": "Barbara Taranto", "date": "2008-09-11T01:25:45Z", "path": "/2008/slaying-the-scary-monsters/", "order": "002512145023"}, {"comment": "<p>The kobold chieftain shall not be defeated by the likes of you.</p>", "indent": 0, "name": "Mike Giarlo", "date": "2008-09-09T06:06:08Z", "path": "/2008/slaying-the-scary-monsters/", "order": "002512145019"}], "/2011/in-memoriam-bob-frost/": [{"comment": "<p>As freshman and a sophmore at SUNY Albany in 1989, I had the honour of taking classes by Professor Frost three times. They were, without doubt, the most exciting, illuminating, challenging and memorable  during my time at Albany. It was with a great sense of shock that I learned of his passing. He was an inspiring man who loved teaching, and whose students loved to be taught by him. The many generations whose lives he has touched are his greatest legacy. I have never forgotten him and never will. The world is a poorer place with his lost. Godspeed Bob.</p>", "indent": 0, "name": "Robert Raffi Varoujian", "date": "2011-09-20T16:46:05Z", "path": "/2011/in-memoriam-bob-frost/", "order": "002512145193"}, {"comment": "<p>OMG, Bob gave me a bootleg copy of WR too. And boy, I needed it. Bob did great work historicizing and theorizing a discipline (and profession) that too often is dominated by what I've heard him call the codeheads -- people who think that anything that happened more than ten years previous isn't worth talking about, who have no sense of history and struggle and equality, and what that might have to do with what we do. Bob professed the utility and joy of theory.</p><p>I know that at least while I was at SI, there was a small but vocal minority of students who felt alienated by the business-school-lite curriculum. We could always count on Bob to represent with cultural studies, French theory, and a healthy dose of radicalism (or at least really fun mouthing off). I think I would have dropped out of graduate school if it wasn't for Bob Frost.</p><p>Bob was so many things all at once -- funny, flaky, brilliant, scattered, insightful, principled, pontificating, subversive. Most importantly, I think, was that Bob was FUN. He gave me hope that there is room for people to think important things and for that process to be meaningful in such a nuts and bolts profession. He built meaningful relationships with his students that weren't just about the economy of the classroom - he truly let us contribute our best selves, with very few limits.</p>", "indent": 0, "name": "Maureen", "date": "2011-03-28T23:48:42Z", "path": "/2011/in-memoriam-bob-frost/", "order": "002512145191"}, {"comment": "<p>Bob Frost, you were the greatest professor a student could ask for; your class more than any other single contributing factor, has motivated my future aspirations. I thank you for our in-depth talks and your inspirational enthusiasm for the future of this world.<br>with sadness,<br>just one of an innumerable amount of inspired students.</p>", "indent": 0, "name": "Alex Horak", "date": "2011-03-28T08:01:10Z", "path": "/2011/in-memoriam-bob-frost/", "order": "002512145185"}], "/2009/lightening-the-load-drupal-and-python/": [{"comment": "<p>Not yet, but thanks for the heads up. Does ElementSoup have the same sort of XML/SGML support as BeautifulStoneSoup?</p>", "indent": 0, "name": "Mark A. Matienzo", "date": "2009-01-08T19:13:07Z", "path": "/2009/lightening-the-load-drupal-and-python/", "order": "002512145045"}, {"comment": "<p>Nice article! Did you already have a look at ElementSoup (<a href=\"http://codespeak.net/lxml/elementsoup.html)\" rel=\"nofollow noopener\" title=\"http://codespeak.net/lxml/elementsoup.html)\">http://codespeak.net/lxml/e...</a>, lxml's robust HTML parser?</p>", "indent": 0, "name": "Andre Hagenbruch", "date": "2009-01-08T12:39:24Z", "path": "/2009/lightening-the-load-drupal-and-python/", "order": "002512145037"}], "/2013/privilege-archives-technology/": [{"comment": "<p>I think there's a need for one for a few reasons. First, it demonstrates that SAA is concerned about the community of its attendees and its members. Secondly, while I can't speak to details, I am aware of a couple of troubling incidents at/within Code4lib in the past.</p><p>I don't think having an anti-harassment policy is necessarily a solution in search of a problem because sexism (and racism, etc.) are systemic and more than just bigotry. If as an organization SAA is going to be committed to diversity, the organization has to make it clear that it is willing to stand with and behind everyone who participates in events like the annual meeting.</p>", "indent": 1, "name": "Mark A. Matienzo", "date": "2013-10-16T13:22:38Z", "path": "/2013/privilege-archives-technology/", "order": "001084313773,001084328095"}, {"comment": "<p>Interesting post, especially this concept of the code of conduct.  Why do you think there's a need for one?  Reading the ones you posted, I'm alarmed that this suggests that harassment and discrimination have occurred at these other conferences (never been to them)--otherwise, to create such a policy would be a solution in search of a problem, right?  I can't recall ever encountering even the trace of bigotry at SAA--just a few waves of your garden variety intellectual differences of opinion amidst an ocean of tolerance and support, but maybe others have?</p>", "indent": 0, "name": "Jordon", "date": "2013-10-16T13:07:24Z", "path": "/2013/privilege-archives-technology/", "order": "001084313773"}, {"comment": "<p>There's so much that I like here. Anything that we can do to demystify (or de-center) the \"digital\" in \"digital archives\" is good work, in my view.</p><p>As a wise man once said, \"I'm a digital archivist, or, as I'll be known in the future, an archivist.\"</p><p>Our work is to acquire, arrange and describe, provide access to and preserve records (traces) of human activities within the scope of our collecting policies, regardless of those records' format. We as practitioners, resource-allocators, educators, and users have to take this mission seriously. Digital is not “extra”, a project, the future, an indulgence, or the next generation’s problem.</p><p>This doesn't mean that the technical challenges that accompany electronic records aren't real, or don't require skill. But a lot of our work requires skill already, and there are plenty of smart archivists out there. I would say (as you have suggested) that capacity toward skill is much more widely distributed than the subset we see of folks actually working with electronic records.</p><p>There's been a lot of work done elsewhere about why work in technology skews male. This seems especially striking in library technology, a subset of a field that is otherwise hugely woman-dominated. I think that diminishing the figure of the \"expert\" is a huge first step toward making it clear that the bits and pieces of skill that fit into already-existing archival theory and practice are attainable by any good archivist, regardless of background. I'm not sure that the technical education for archivists I see has this point of view. Instead of a long set of expensive workshops toward a credential that may or may not be relevant as challenges change, I also prefer your model of building community around problem solving and skill share.</p><p>I'm excited about the newly-formed Computer Anonymous group. It reminds me of the model that I saw at PyStar Philly and GirlDevelopIt (groups for women who want to learn to code) -- a non-competitive, curiosity-fueled space that acknowledges that we work in a system of asymmetry and domination around issues of class, race, gender, gender expression and sexual orientation. Being part of a learning community where my understanding and experience of oppression is acknowledged rather than denied is an important first step toward being able to be an open learner.</p>", "indent": 0, "name": "Maureen", "date": "2013-10-16T14:04:10Z", "path": "/2013/privilege-archives-technology/", "order": "001084369626"}], "/2013/emotion-archives-interactive-fiction-linked-data/": [{"comment": "<p>Wow. What a thoughtful, thought inducing post! Thanks Mark, will be rereading this more than once</p>", "indent": 0, "name": "Andrew Wilson", "date": "2013-02-18T23:26:06Z", "path": "/2013/emotion-archives-interactive-fiction-linked-data/", "order": "000803538050"}, {"comment": "<p>I've read this a few times, Mark, and will likely read it again and have other thoughts that might be more pertinent to your points. For now, though, I want to comment on unity in the profession, because this seems like the best place for it right now and it's something I've been thinking about.</p><p> In between readings of your piece, I keep finding myself thinking about conferences, I guess because that's so much of my life as an archivist and software developer now. At conferences, when listening to the first 5 minutes or so of the beginning of any talk, I'm trying to assess where the speaker is coming from. Are they talking to me, a digitally-minded archivist with a background heavy in theory but a heart that bleeds for under-represented communities and thrills at new ways to interact with archives? I wonder this because I've found that if they are not, in fact, talking to me, the room can get downright hostile. This speaks to the larger problem in our profession of segregating the academics from the practitioners, the technologically-minded from the analogue, the traditional from the 'post-modern'.</p><p>I'm rambling a bit but I'll try to summarize. What I want to build is a profession where we can all just get along (I couldn't resist, haha!). We could build something so much better if we all talked to each other without brandishing hostility towards the different kinds of archivists, including the ones who are librarians and including the ones who are historians/genealogists/etc. I don't think you need agreement to have unity. Maybe we could all start tailoring our talks so that the whole room knows we're engaging them no matter where they fall on the archivist spectrum. Get deep, get serious, but in the first few minutes, maybe we could start by channeling our hostility into statements of purpose - that is, tell me what you want to build or how you see our world and put some heart in it. Be inclusive. Even writing this, it feels revolutionary to say. I picture high-theorists scoffing at this idea... but you know what, that's exactly what I'm talking about. I don't want the fear anymore.</p>", "indent": 0, "name": "Guest", "date": "2013-02-27T22:57:21Z", "path": "/2013/emotion-archives-interactive-fiction-linked-data/", "order": "000814629898"}, {"comment": "<p>Thanks for this awesome post. I'm on your side too Mark, and am looking forward to exploring the ideas more.</p><p>One question: do you see blogging here as you just did to be a microcosm for the sort of work you are talking about? I'd be curious to know what is the same, and what is missing. Over the last year, largely due to me following along in your and Tim's footsteps, I've found myself daydreaming about improved editing environments for archival description, that actually use some of the Linked Data collections that are out there now. I explored this a teensy bit on <a href=\"http://jobs.code4lib.org\" rel=\"nofollow noopener\" title=\"jobs.code4lib.org\">jobs.code4lib.org</a>. I guess I need to play with Twine and investigate some of the stories you've linked out to here to see what the state of play is.</p><p>You mentioned Facebook. I'm not a huge user, or fan of their strategy to commoditize people's lives and emotions. But one thing they really got right is giving people an audience to create for. When people share photos, status updates, or links to stories elsewhere, they are aware of who they are sharing with, are able to see (via likes and comments) the effects that their content has had on others, and they can use that feedback to cultivate their audience, and their future content. It seems like this is something that archives are missing.</p><p>I would like to help make archives be more personal: to provide a social context for description, that lets archivists do their work more collaboratively, and creatively, while acknowledging their voice -- and hopefully bootstrapping description by others who are outside of the profession. That's when things take on a political flavor. I often dumb this down as making sure archival content is addressable on the Web (has a permalink) ... but I think you are right to point out that this is not enough, and there's so much more to be done.</p>", "indent": 0, "name": "Ed Summers", "date": "2013-02-20T12:05:15Z", "path": "/2013/emotion-archives-interactive-fiction-linked-data/", "order": "000805536926"}, {"comment": "<p>Thanks, Peter!</p>", "indent": 1, "name": "Mark A. Matienzo", "date": "2013-02-18T18:51:41Z", "path": "/2013/emotion-archives-interactive-fiction-linked-data/", "order": "000803215507,000803246854"}, {"comment": "<p>Thanks, so much Mark. This speaks to heart and mind in such an intimate way. I'll have to read it several times, but it has already touched me. Hugs!</p>", "indent": 0, "name": "disqus_GWRstsFTSr", "date": "2013-02-19T21:10:51Z", "path": "/2013/emotion-archives-interactive-fiction-linked-data/", "order": "000804729745"}, {"comment": "<p>I agree wholeheartedly. I think an important part of unity of the profession is the willingness to engage respectfully. We shouldn't be afraid of this. We need to rebuild the community that we want to see rather than worrying about the hostility that we've seen so far. I'm so happy you feel the same way, Courtney!</p>", "indent": 1, "name": "Mark A. Matienzo", "date": "2013-03-05T01:46:55Z", "path": "/2013/emotion-archives-interactive-fiction-linked-data/", "order": "000814629898,000819489460"}, {"comment": "<p>I'm on your side brother. Thanks for your honesty and vision. We seem to be on some parallel/crisscross path. I've also been debating role/future of centralized social media/data, and had a tough 2012 and, instead of emotion (but very much related), have been obsessed with spirituality, archives and technology. Too soon and too much dayjob minutia for me to post more details anytime soon but your thoughts and work continue to inspire. I look forward to following your progress and contributing where I can. What we should build is a social network (shared digital conciousness? to frame and/or shadow our superconcious?) by the people for the people. \"For us archivists, there can be no conclusions, no finality, no obiter dicta. We are builders of bridges, not castles, as we cross from the assurances of 'now' to the uncertainty of 'new'.\" --Hugh Taylor. \"Afterword\" in Imagning Archives: Essays and Reflections by Hugh Taylor (2003), 251.</p>", "indent": 0, "name": "Peter Van Garderen", "date": "2013-02-18T18:17:19Z", "path": "/2013/emotion-archives-interactive-fiction-linked-data/", "order": "000803215507"}], "/2007/hey-chicago/": [{"comment": "<p>Hey, I do what I can. :) Really, though, I don't know how that happened.</p>", "indent": 0, "name": "Mark A. Matienzo", "date": "2007-09-01T03:26:43Z", "path": "/2007/hey-chicago/", "order": "002512144986"}, {"comment": "<p>They were about halfway between the Fairmont and Millennium Park and we assumed you were grabbing something from your bag and they were dropped. Or perhaps folks decided they simply did not want your cards after you handed them out? ;)</p>", "indent": 0, "name": "Amy", "date": "2007-09-03T21:31:26Z", "path": "/2007/hey-chicago/", "order": "002512144984"}, {"comment": "<p>I like the way you get your name out there to the people of Chicago: <a href=\"http://www.flickr.com/photos/knowingmybliss/1287606987/\" rel=\"nofollow noopener\" title=\"http://www.flickr.com/photos/knowingmybliss/1287606987/\">http://www.flickr.com/photo...</a>.</p>", "indent": 0, "name": "Amy", "date": "2007-09-01T00:56:47Z", "path": "/2007/hey-chicago/", "order": "002512144985"}], "/2009/clifford-lynch-response-to-leaked-sirsidynix-report/": [{"comment": "<p>Looks like being one of the greatest extemporaneous speakers ever finally caught up to Lynch.</p>", "indent": 0, "name": "Alex Hauschild", "date": "2010-03-10T02:42:00Z", "path": "/2009/clifford-lynch-response-to-leaked-sirsidynix-report/", "order": "002512145123"}], "/2008/dead-reckoning/": [{"comment": "<p>One thing you do not mention about faceted terms that I have never liked about EAD is that the examples you see from the big EAD producers show the faceting going on in the attributes and values, not as separate elements in EAD.  This scares me.</p>", "indent": 0, "name": "Russell D. James", "date": "2009-01-01T14:39:00Z", "path": "/2008/dead-reckoning/", "order": "002512145036"}], "/2010/the-future-of-archivesblogs/": [{"comment": "<p>Hi Mark,</p><p></p><p></p><p>I can't offer any assistance in taking over ArchivesBlogs, but I just wanted to let you know that I've found it a very useful tool. Via this blog and Google Reader I get details on archives, libraries &amp; museums worldwide that helps put the scene in the UK into context. It also gives information on ideas and projects that would have otherwise passed me (and others) by.</p><p></p><p></p><p>Regards,</p><p></p><p></p><p>Gary</p>", "indent": 0, "name": "Gary Collins", "date": "2010-10-22T14:33:51Z", "path": "/2010/the-future-of-archivesblogs/", "order": "002512145170"}, {"comment": "<p>Mark,</p><p></p><p></p><p>I would be interested in talking with you about it. I have an interest in it, and I have someone in mind who might be able to help with managing it. I have a pretty strong background with all of the things that you technologies you mentioned above. You can contact me via email if you haven't found anyone yet.</p><p></p><p></p><p>Thanks,<br>Jason</p>", "indent": 0, "name": "Jason Fowler", "date": "2010-10-27T18:02:38Z", "path": "/2010/the-future-of-archivesblogs/", "order": "002512145171"}, {"comment": "<p>I'd be interested in helping take on this task!</p><p></p><p></p><p>-I've got the HTML and CSS;<br>-I've had classes in PHP &amp; MySQL but it hasn't necessarily stuck since I haven't used them afterwards;<br>-I have CMS experience, though not with WordPress or Drupal;<br>-And again I've done the SSH and SFTP, though it's been a while.</p><p></p><p></p><p>I'm a quick learner (aren't all we hungry little archivistas) and I'm looking for a way to contribute to the profession.  Also I can probably find help from the pool of my former and current coworkers.</p><p></p><p></p><p>All best,<br>Michelle</p>", "indent": 0, "name": "Michelle Belden", "date": "2010-09-22T00:43:58Z", "path": "/2010/the-future-of-archivesblogs/", "order": "002512145165"}], "/2006/responsetolannon/": [{"comment": "<p>I enjoyed reading this post.  I think some people are confused as to why I keep a formal, institutional tone in my archives blog.  The reason for this is simple: the purpose of the SPSU archive blog is exactly what it says at the top of the page.  The blog is there to update the community on our progress.  I often wish I could post more about archival issues - I wish I could vent when I'm frustrated by EAD, or openly rejoice when I've got a new search function to work.  But the purpose of the institutional blog is to act as a sort of shorthand for people who don;t know what an archive is or why the university is spending so much money setting one up.</p><p>I love reading blogs like this though, and Spellbound, and others.  It keeps me feeling like I've got a bead on current trends or helps me review topics of study I've forgotten.</p>", "indent": 0, "name": "Elizabeth Keathley", "date": "2006-09-25T18:53:21Z", "path": "/2006/responsetolannon/", "order": "002512144966"}, {"comment": "<p>Mark,</p><p>I should have first complemented you on your efforts to compile blogs about archives, before beginning an unsolicited rant on the topic. However, I am glad that my post triggered you to compose such an eloquent and useful statement regarding your 'ArchivesBlogs' project. I started reading blogs about archives when seeking information about presentations from the SAA Washington, D.C. conference. Jeanne Kramer-Smythâ€™s and RLG's Hanging Together both provided helpful postings which relayed much useful information to the inquisitive yet not-in-attendance archivist.  To this emerging archival blogger community, I would like to extend my gratitude and offer my sincerest respect, whatever that may be worth. I have a suspicion that blogging will take on an increasingly important role in information dissemination at future SAA conferences.</p><p>As the administrator of â€˜ArchivesBlogs,â€™ Mark you should obviously feel free to add, remove and edit feeds however you see fit. However, one way to keep â€˜ArchivesBlogsâ€™ on track might be to feed relevant tags from blogs, instead of feeds representing the blog itself. For instance, I have a slight suspicion that ArchivesBlogs readers are not going to want to see some of the rubbish I post on my blog such as my on going quest to read every possible interpretation of the historian Perry Miller.</p><p>The power of blogging is evinced when communities or networks occur in which people participate in open debate, and share ideas about which they harbor thoughtful care. It is at this precise moment however, when unsettling aspects of our 2.0 identities arise, as bloggers become more than strangers firing missives off into the ether. We become known to one another through our written thought.  However obvious this point may be, I find it very disconcerting as at times I do not wish to amplify my ideas as loud as blogging is capable.  I should have thought about this before writing a post and linking back to ArchivesBlogs, and instead written a more discrete e-mail.</p><p>Now that the damage is done, and I have made my presence felt (even if only to you Mark) I would like to let you know that I am an archivist (note: not an anarchivist,) a graduate student (at the CUNY Graduate Center) and an avid user of library catalogs. I believe we both have B.A.â€™s in philosophy, enjoy music and our roughly the same age.  I was thinking about attending the Library Camp East event today, but instead decided to go to work to try and finish up the finding aids for the Florence Kelley Papers and Nicholas Kelley Papers on which I have been working for the last few months. I will continue to check back into the Secret Mirror and ArchivesBlogs in the future. Thank you for your time and consideration.</p>", "indent": 0, "name": "Thomas Lannon", "date": "2006-09-26T03:45:24Z", "path": "/2006/responsetolannon/", "order": "002512144967"}, {"comment": "<p>I had figured that out before but it my memory lapsed on how to do that. I figured there'd be a lazyweb response from someone, though. Thanks!</p>", "indent": 0, "name": "Mark A. Matienzo", "date": "2006-09-25T00:20:57Z", "path": "/2006/responsetolannon/", "order": "002512144968"}, {"comment": "<p>Mark, a very intersting post. FYI, if you want to link citations to a resource that will surface library copies of the item, you can link to <a href=\"http://worldcat.org\" rel=\"nofollow noopener\" title=\"worldcat.org\">worldcat.org</a>. So for  In the Freud Archives, you could have linked to <a href=\"http://worldcat.org/isbn/0394538692\" rel=\"nofollow noopener\" title=\"http://worldcat.org/isbn/0394538692\">http://worldcat.org/isbn/03...</a></p>", "indent": 0, "name": "Eric Childress", "date": "2006-09-28T19:47:46Z", "path": "/2006/responsetolannon/", "order": "002512144969"}, {"comment": "<p>Mark, you can override Google's stemming (along the with removal of common \"stop\" words) with a plus sign, e.g. using \"+archival\" instead of \"archival.\"</p>", "indent": 0, "name": "Andrew Bangert", "date": "2006-09-24T21:29:55Z", "path": "/2006/responsetolannon/", "order": "002512144963"}], "/2010/delicious-and-the-preservation-of-platforms/": [{"comment": "<p>I agree Mark -- in particular about the \"qualified researcher\" bit. I think it remains to be seen just how LC is going to manage and provide access to the Twitter archive.  So it's kind of premature to encourage Yahoo to donate the delicious content to LC if delicious did have to close down.</p>", "indent": 0, "name": "Ed Summers", "date": "2010-12-23T18:14:49Z", "path": "/2010/delicious-and-the-preservation-of-platforms/", "order": "002512145174"}], "/2009/a-birds-eye-view-of-archival-collections/": [{"comment": "<p>Hey Mark, thanks for the writeup; and I appreciate the links to those related projects. I should apoplogise in advance for my source code though: I'm a hacker more than a coder, so it's not pretty. On the other hand as a hacker I can recommend Processing and its community without reservation! cheers - Mitchell</p>", "indent": 0, "name": "Mitchell", "date": "2009-01-22T03:44:09Z", "path": "/2009/a-birds-eye-view-of-archival-collections/", "order": "002512145047"}], "/2008/easy-peasy-using-the-flickr-api-in-python/": [{"comment": "<p>Beautiful, Mark! Any chance of enriching the tags?</p><p>For instance, I'd like to be able to find<br><a href=\"http://www.flickr.com/photos/esva/2364071847/in/set-72157604268234970/\" rel=\"nofollow noopener\" title=\"http://www.flickr.com/photos/esva/2364071847/in/set-72157604268234970/\">Kepler</a> by Kepler or Johannes, rather than Kepler, Johannes.</p>", "indent": 0, "name": "Jodi Schneider", "date": "2008-03-27T18:24:02Z", "path": "/2008/easy-peasy-using-the-flickr-api-in-python/", "order": "002512144993"}, {"comment": "<p>I'd like to add this functionality, but it wouldn't be too easy to do automatically when you consider names like \"Van de Graaff\". I guess I could do some regular expression magic - I'll talk to my coworkers and see what they think.</p>", "indent": 0, "name": "Mark A. Matienzo", "date": "2008-03-27T19:02:03Z", "path": "/2008/easy-peasy-using-the-flickr-api-in-python/", "order": "002512144989"}], "/2008/now-it-can-be-told/": [{"comment": "<p>Congrats, Mark.  Sounds like a good fit.  Who knows what magic you all will cook up there?</p>", "indent": 0, "name": "Gabriel Farrell", "date": "2008-04-21T04:18:47Z", "path": "/2008/now-it-can-be-told/", "order": "002512144995"}, {"comment": "<p>Congratulations -- what a great opportunity!</p>", "indent": 0, "name": "Aimee", "date": "2008-04-21T21:27:13Z", "path": "/2008/now-it-can-be-told/", "order": "002512145001"}, {"comment": "<p>Great! Looks like it will be easier to have another unconference here someday, as everyone keeps moving to town. Hope your move here is smooth and trouble-free.</p>", "indent": 0, "name": "Stephen Francoeur", "date": "2008-04-22T20:43:41Z", "path": "/2008/now-it-can-be-told/", "order": "002512145000"}, {"comment": "<p>Hurrah - I am so glad to hear that you have found such a great next step in your career.</p>", "indent": 0, "name": "Jeanne", "date": "2008-04-21T18:50:25Z", "path": "/2008/now-it-can-be-told/", "order": "002512144999"}], "/2006/archivesblogs-update-service-links/": [{"comment": "<p>Great to see how Widget::Simple is integrated with existent Plaggnet sites. Was that easy? Did you make your own and want to share? Give me your feedback.</p>", "indent": 0, "name": "miyagawa", "date": "2006-08-25T07:30:36Z", "path": "/2006/archivesblogs-update-service-links/", "order": "002512144953"}, {"comment": "<p>Yeah, multiple calls to Widget::Simple in config is sane. I'd like to allow saying it once for multiple configs though.</p>", "indent": 0, "name": "miyagawa", "date": "2006-08-26T07:20:37Z", "path": "/2006/archivesblogs-update-service-links/", "order": "002512144952"}, {"comment": "<p>It was totally easy! I'm not sure if I'm doing it right, though - what's the best way to call Widget::Simple? I have multiple calls of it in my config.yaml. Should it be reading from other config files instead?</p><p>I'm probably going to make a plugin for <a href=\"http://unalog.com/\" rel=\"nofollow noopener\" title=\"http://unalog.com/\">unalog</a>, too.</p>", "indent": 0, "name": "Mark A. Matienzo", "date": "2006-08-25T17:24:02Z", "path": "/2006/archivesblogs-update-service-links/", "order": "002512144947"}, {"comment": "<p>You can store yaml file for unalog, for example, in assets/plugins/Widget-Simple. See other *.yaml files in the directory as an example :-) Then specify</p><p>  - module: Widget::Simple<br>     config:<br>      widget: unalog</p><p>and you're set.</p>", "indent": 0, "name": "miyagawa", "date": "2006-08-26T07:19:33Z", "path": "/2006/archivesblogs-update-service-links/", "order": "002512144954"}], "/2011/whats-your-delicious-story/": [{"comment": "<p>We used delicious as a coordination tool for building a Database of relevant websites for historical research in Switzerland. One delicious account was used simultaneously by 3 persons. We made our first selection bookmarking and tagging websites on Delicious. Then we started to integrate the websites in our Database. Tasks were shared among collaborators according to the delicious tags - \"archive\", \"library\", \"historical association\" etc. <br>We also used Delicious for monitoring the progress of our work. By tagging \"done\" each resource included in our Database, we could follow live the progress of our work. I worked well, and we're still using it to bookmark websites to be added.</p>", "indent": 0, "name": "Enrico Natale", "date": "2011-01-06T13:48:46Z", "path": "/2011/whats-your-delicious-story/", "order": "002512145178"}, {"comment": "<p><a href=\"http://deli.cio.us\" rel=\"nofollow noopener\" title=\"deli.cio.us\">deli.cio.us</a> was the really my first cloud-based data storage service. It solved a major problem I was having which was that I habitually work on several computers and often change browsers. Under those circumstances, browser-based bookmarking is futile and worst, I would often find myself looking at bookmarks months later wondering why or what had made me save that location. (This is even worse when the page has moved or disappeared.)</p><p>The ability to store bookmarks online, accessible from anywhere, coupled with the ability to tag them and to explicitly share them with others was incredibly liberating.</p><p>For several years it was also standard practice when creating talks to tag the pages I wanted to display at the talk. Then, as part of prep onsite I could very quickly load each of those locations in a separate tab. Fast, accurate, and still the easiest way to prep for that kind of talk.</p><p>Truth is, though, that I bookmark less with <a href=\"http://deli.cio.us\" rel=\"nofollow noopener\" title=\"deli.cio.us\">deli.cio.us</a> now. I still value the ability to have the site tell me when I am bookmarking something already bookmarked (not a feature of, say, tumblr or twitter), and miss the instant view of how others have tagged a page (and what they are viewing). But I find myself using it less, nonetheless. It's like <a href=\"http://deli.cio.us\" rel=\"nofollow noopener\" title=\"deli.cio.us\">deli.cio.us</a> captured a moment in time and then never developed further.</p><p>My question to others is how you will replace the service? I have tentatively rolled my data over to the new <a href=\"http://deli.cio.us\" rel=\"nofollow noopener\" title=\"deli.cio.us\">deli.cio.us</a>, but I'm not sure I'll leave it there. Mostly, it has become something like Zotero for me--something that does a few things wonderfully and is otherwise not enough a part of how I work right now. That doesn't mean that I've replaced it; it means that I spend too little time on <a href=\"http://deli.cio.us\" rel=\"nofollow noopener\" title=\"deli.cio.us\">deli.cio.us</a> for it to be part of my life anymore. But nothing else has stepped in.</p><p>What are other people doing/using?</p>", "indent": 0, "name": "Ari Davidow", "date": "2011-06-06T19:15:43Z", "path": "/2011/whats-your-delicious-story/", "order": "002512145179"}, {"comment": "<p>When my library first started using Blogger for a reference staff blog, the service didn't yet offer tags or categories, so we began using Delicious to index blog posts. <a href=\"http://www.delicious.com/referencenewman\" rel=\"nofollow noopener\" title=\"http://www.delicious.com/referencenewman\">http://www.delicious.com/re...</a></p>", "indent": 0, "name": "Stephen Francoeur", "date": "2011-01-05T08:25:27Z", "path": "/2011/whats-your-delicious-story/", "order": "002512145183"}, {"comment": "<p>It's not certain that Delicious is getting shut down any time soon, but it's possible that Delicious could shut down eventually, even if sold, spun-off, or if Yahoo! suddenly decides it's worth something again. Regardless, the point is the same - which uses are the less obvious, or perhaps even less official (potentially even violating the TOS!), but have become something notable enough about how they are more than just about \"saving a page for later.\"</p>", "indent": 1, "name": "Mark A. Matienzo", "date": "2011-01-05T08:41:38Z", "path": "/2011/whats-your-delicious-story/", "order": "002512145177,002512145184"}, {"comment": "<p>Similar to your example, I use delicious a lot for project research and conference talk planning. I'm stuck between Zotero and Delicious at the moment and imported my Delicious history into Zotero during the frenzy, but still habitually use Delicious. I guess I really like it and don't want it to go away.</p>", "indent": 0, "name": "Nick Ruest", "date": "2011-01-06T05:14:01Z", "path": "/2011/whats-your-delicious-story/", "order": "002512145187"}, {"comment": "<p>Delicious getting shut down is not certain. We know from a leak that Yahoo isn't that interested in doing anything more with it. But it could very well be sold or spun-off, not shut down.</p><p>One interesting use the way anything tagged '#code4lib' will show up on the Planet Code4Lib aggregator. In this way, if I want to share something with #code4lib, I've just got to tag it using my firefox or chrome browser plugin, in a couple clicks I know I'm sharing with the community. Any comments I enter in my bookmark will even show up in the Planet feed. In this way, delicious can end up almost like twitter (but specifically for sharing links, which is just one of twitters uses), bookmarking something with a certain tag that you know gets re-published elsewhere or otherwise followed by a certain community.</p>", "indent": 0, "name": "Jonathan Rochkind", "date": "2011-01-05T08:36:21Z", "path": "/2011/whats-your-delicious-story/", "order": "002512145177"}], "/2009/why-you-should-support-linked-data/": [{"comment": "<p>That's a stunning photo of edsu.</p>", "indent": 0, "name": "Ross", "date": "2009-03-28T23:26:32Z", "path": "/2009/why-you-should-support-linked-data/", "order": "002512145067"}], "/2008/v8-powered-libraries-and-the-happiness-engines-that-run-them/": [{"comment": "<p>A couple of ideas:<br>1.  I found your site tonight by randomly selecting from a list posted at the exciting blog Bibliodyssey (great set of links).  So what about listing links to other bookish sites along your margin here?  Interesting sites tend to do this.<br>2.  Earlier today I googled the library because I was searching for a specific text.  However, your interesting site does not come up thru googling your library using the terms \"new york public library index\".  Not readily anyway, i just tried it again to make sure.  What about you being more of the online social face of nypl?<br>3.  Now, the book I was looking for is a Harvard-Yenching Institute Concordance of Chinese Characters used in the Chuang Tzu, recommended as useful by all the serious translators, but I've never seen a copy and there's nothing on googlebooks.  (I am doing my own translation for a version I'm illustrating.)  You have the book \"off-site\": <a href=\"http://catnyp.nypl.org/search?/Xyenching+concordance&amp;searchscope=1&amp;SORT=R/Xyenching+concordance&amp;searchscope=1&amp;SORT=R&amp;SUBKEY=yenching%20concordance/1%2C10%2C10%2CB/frameset&amp;FF=Xyenching+concordance&amp;searchscope=1&amp;SORT=R&amp;2%2C2%2C\" rel=\"nofollow noopener\" title=\"http://catnyp.nypl.org/search?/Xyenching+concordance&amp;searchscope=1&amp;SORT=R/Xyenching+concordance&amp;searchscope=1&amp;SORT=R&amp;SUBKEY=yenching%20concordance/1%2C10%2C10%2CB/frameset&amp;FF=Xyenching+concordance&amp;searchscope=1&amp;SORT=R&amp;2%2C2%2C\">http://catnyp.nypl.org/sear...</a> .  <br>I would like to inspect a few pages to understand how it is organized so that I can decide whether I ought to buy my own copy via abebooks (o.p. $220).  So here is a social function you could perform by sharing some scans online (I'm in northern New Hampshire).  If there was sort of a person at an online window who was interested in helping users this way, I think that would be a very good way to innovate your site.  What do you think?  Maybe I'm just too out of it and don't understand how these things work.<br>4.  Actually I noticed that the page prompted by the url listed in #3 offers some sort of possibility of doing this, but the way the page looks I feel as though I am not \"authorized\" or something, that I may not do it right in some way, so then I demur.  So this is an interesting interface problem.  How to induce the user to use all the functionality of the catalogue index interface?  After all, this is a basic function for the library and the user.<br>Thanks, I think your blog looks very promising here.  Love the library, btw... (oh, one last thing, ARG, IU, UA, etc etc, all the abbreviations...spell them out the first time you use them in a post, then abbreviate, otherwise nobody understands what you are talking about and you lose your audience, WTTW)</p>", "indent": 0, "name": "Stefan Saal", "date": "2008-11-08T06:54:08Z", "path": "/2008/v8-powered-libraries-and-the-happiness-engines-that-run-them/", "order": "002512145024"}, {"comment": "<p>A few years back I put a simple alternate reality game on our public library blog. It was called \"Murder in the Library.\" I wrote a short entry describing the corpse and the crime scene - a certain book in the victim's hand with a sentence underlined, contents of the victim's wallet, etc. - and asked people to play detective. They submitted their stories as comments on the blog (moderated). The response was enthusiastic, with more stories than I'd hoped for - most of them surprisingly imaginative. I didn't do a repeat performance - went on to some other concept - but now you've got me thinking it's time to do it again!</p>", "indent": 0, "name": "Daniel Clark", "date": "2008-11-18T05:41:00Z", "path": "/2008/v8-powered-libraries-and-the-happiness-engines-that-run-them/", "order": "002512145031"}, {"comment": "<p>Stefan, thanks for your comments - I'll respond to them one by one.</p><p>1. That's a great idea, and I'll suggest it to the other people in the department. I think it would make more sense to have us compile a list and put as a post that we can go back and revise regularly.</p><p>2. I'm not sure what you mean about being the \"more social\" face - we part of a larger NYPL blogosphere. Other NYPL blogs can be found at <a href=\"http://nypl.org/blog/\" rel=\"nofollow noopener\" title=\"http://nypl.org/blog/\">http://nypl.org/blog/</a> .</p><p>3. In terms of that book, if you click on the \"OFFSITE\" link, a pop up window comes up that tells you how you can request that book to consult onsite or how to order a free digital copy of  part of the book. If you can't find it, that page is located at <a href=\"http://catnyp.nypl.org/screens/loc_rc.html\" rel=\"nofollow noopener\" title=\"http://catnyp.nypl.org/screens/loc_rc.html\">http://catnyp.nypl.org/scre...</a> .</p><p>In terms of online reference help, we do provide chat-based reference  - see <a href=\"http://nypl.org/questions/chat.html\" rel=\"nofollow noopener\" title=\"http://nypl.org/questions/chat.html\">http://nypl.org/questions/c...</a> for more information.</p><p>4. I agree with you that the language on that page is not  really straightforward. One of our major tasks is to increase the usability of the library website and make it easier for people to find library materials.</p>", "indent": 0, "name": "Mark A. Matienzo", "date": "2008-11-09T00:45:34Z", "path": "/2008/v8-powered-libraries-and-the-happiness-engines-that-run-them/", "order": "002512145032"}]}
